package com.example.kast.changelogs;


import com.example.kast.mongo_collections.documents.CountryDoc;
import com.example.kast.mongo_collections.interfaces.CountryRepository;
import io.mongock.api.annotations.ChangeUnit;
import io.mongock.api.annotations.Execution;
import io.mongock.api.annotations.RollbackExecution;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.Comparator;
import java.util.List;


/**
 * Данный класс содержит логику для миграции списка объектов класса {@link CountryDoc}. Используется для инициализации
 * соответствующей коллекции базы данных
 *
 * @author Кирилл "Tamada" Симовин
 */
@ChangeUnit(id = "CountriesChangeLog", order = "20001", author = "Tamada")
public class CountriesChangeLog {
    /**
     * Метод позволяет сохранить полученный список объектов класса {@link CountryDoc}, содержащих информацию обо всех
     * странах, для которых подготовлены svg версии флагов
     *
     * @param countryRepository интерфейс для взаимодействия с сущностями {@link CountryDoc}
     */
    @Execution
    public void changeSet(CountryRepository countryRepository) {
        getCountries().forEach(countryRepository::save);
    }


    /**
     * Метод позволяет откатить внесенные изменения
     */
    @RollbackExecution
    public void rollback() {
    }


    /**
     * Метод позволяет получить список всех стран, для которых подготовлены svg версии флагов.<br></br>
     * <i>Не для всех стран приведен полный список городов. Вероятно, для большинства стран не указаны и главные города.
     * Всё это сделано постольку, поскольку данный метод призван продемонстрировать пример работы.
     * При желании можно добавить недостающие города в соответствующие страны </i><br></br><br></br>
     * Список городов получен с использованием следующих источников:
     * <li><a href="https://ru.wikipedia.org/">Википедия</a></li>
     * <li><a href="https://www.tursvodka.ru/">Турсводка</a></li>
     *
     * @return Список объектов класса {@link CountryDoc}, содержащих информацию обо всех странах
     */
    private ArrayList<CountryDoc> getCountries() {
        ArrayList<CountryDoc> countryDocs = new ArrayList<>(Arrays.asList(
                new CountryDoc(
                        "Афганистан",
                        "Afghanistan",
                        new ArrayList<>(Arrays.asList("Газни", "Герат", "Джелалабад", "Кабул", "Кандагар", "Кундуз",
                                "Лашкаргах", "Мазари-Шариф", "Пули-Хумри", "Талукан", "Чарикар", "Шибарган"))
                ),
                new CountryDoc(
                        "Аландские острова",
                        "Aland Islands",
                        new ArrayList<>(Arrays.asList("Аланд", "Вордё", "Дегерё", "Кумлинге", "Лемланд", "Лумпарланд",
                                "Сеглинге", "Соннбудаландет", "Соттунга", "Хеллсё", "Хуммерсёландет", "Чюркландет",
                                "Чёкар", "Эккерё", "Энклинге", "Эстерсокнен"))
                ),
                new CountryDoc(
                        "Албания",
                        "Albania",
                        new ArrayList<>(Arrays.asList("Балши", "Берат", "Буррели", "Влёра", "Гирокастра", "Дельвина",
                                "Дуррес", "Кавая", "Конисполь", "Корча", "Круя", "Кукес", "Кучова", "Лежа", "Либохова",
                                "Либражд", "Люшня", "Орикум", "Патос", "Пекин", "Пермети", "Пешкопия", "Поградец",
                                "Рубику", "Саранда", "Тепелена", "Тирана", "Тропоя", "Фиери", "Химара", "Чоровода",
                                "Шкодер", "Эльбасан"))
                ),
                new CountryDoc(
                        "Алжир",
                        "Algeria",
                        new ArrayList<>(Arrays.asList("Айн-Бейда", "Айн-Млила", "Айн-Уссера", "Алжир", "Аннаба", "Афлу",
                                "Барика", "Батна", "Беджая", "Бешар", "Бир-эль-Джир", "Бискра", "Блида",
                                "Бордж-Бу-Арреридж", "Бу-Саада", "Гельма", "Джельфа", "Джиджель", "Константина",
                                "Лагуат", "Магния", "Маскара", "Медеа", "Мессад", "Мостаганем", "Мсила", "Оран",
                                "Релизан", "Саида", "Сетиф", "Сиди-Бель-Аббес", "Сиди-Шами", "Скикда", "Сук-Ахрас"))
                ),
                new CountryDoc(
                        "Андорра",
                        "Andorra",
                        new ArrayList<>(Arrays.asList("Андорра-ла-Велья", "Валлнорд", "Грандвалира", "Кальдеа", "Канильо",
                                "Ла-Массана", "Ордино — Аркалис", "Пал — Аринсаль", "Пас-де-ла-Каса — Грау-Роч",
                                "Сольдеу — Эль-Тартер", "Энкамп", "Эскальдес"))
                ),
                new CountryDoc(
                        "Ангола",
                        "Angola",
                        new ArrayList<>(Arrays.asList("Амбриш", "Андуло", "Баилундо", "Бенгела", "Ваку-Кунго", "Ганда",
                                "Джамба", "Дондо", "Дундо", "Каала", "Кабинда", "Катумбела", "Кубал", "Куито", "Лобиту",
                                "Луанда", "Лубанго", "Луена", "Лукапа", "Маланже", "Матала", "Мбанза-Конго", "Менонге",
                                "Намибе", "Негаге", "Н’Далатандо", "Сауримо", "Сойо", "Сумбе", "Уамбо", "Уиже", "Уку"))
                ),
                new CountryDoc(
                        "Антигуа и Барбуда",
                        "Antigua and Barbuda",
                        new ArrayList<>(Arrays.asList("Баклис", "Боланс", "Джолли Харбор", "Джонсонс Пойнт",
                                "Дикенсон Bay", "Инглиш Харбор", "Кодрингтон", "Кулидж", "Мамора Бей", "Олд-Роуд",
                                "Пять Островов", "Сент-Джонс", "Сент-Мэрис", "Фалмут Харбор"))
                ),
                new CountryDoc(
                        "Аргентина",
                        "Argentina",
                        new ArrayList<>(Arrays.asList("Баия-Бланка", "Банфилд", "Берасатеги", "Буэнос-Айрес",
                                "Виррей-дель-Пино", "Годой-Крус", "Гонсалес-Катан", "Грегорио-де-Лаферрере", "Гуаймальен",
                                "Исидро-Касанова", "Кильмес", "Комодоро-Ривадавия", "Конкордия", "Кордова", "Корриентес",
                                "Ла-Плата", "Ла-Риоха", "Ланус", "Лас Эрас", "Мар-дель-Плата", "Мендоса", "Мерло",
                                "Модеро", "Неукен", "Парана", "Посадас", "Ресистенсия", "Рио Куарто", "Рио-Куарто"))
                ),
                new CountryDoc(
                        "Армения",
                        "Armenia",
                        new ArrayList<>(Arrays.asList("Абовян", "Агарак", "Айрум", "Алаверди", "Апаран", "Арарат",
                                "Армавир", "Арташат", "Артик", "Ахтала", "Аштарак", "Берд", "Бюракан", "Бюрегаван",
                                "Вагаршапат", "Вайк", "Ванадзор", "Варденис", "Веди", "Гавар", "Горис", "Гюмри",
                                "Дастакерт", "Джермук", "Дилижан", "Егвард", "Ереван", "Ехегнадзор", "Иджеван",
                                "Каджаран", "Капан", "Маралик", "Мартуни", "Масис", "Мегри", "Мецамор", "Ноемберян"))
                ),
                new CountryDoc(
                        "Аруба",
                        "Aruba",
                        new ArrayList<>(Arrays.asList("Ноорд", "Ораньестад", "Парадера", "Саванета", "Санта-Круз",
                                "Синт-Николас", "Танки Леендерт"))
                ),
                new CountryDoc(
                        "Австралия",
                        "Australia",
                        new ArrayList<>(Arrays.asList("Аделаида", "Албани", "Алис-Спрингс", "Арарат", "Армидейл",
                                "Балларат", "Банбери", "Бандаберг", "Басселтон", "Батерст", "Беналла", "Бендиго", "Берни",
                                "Брисбен", "Брокен-Хилл", "Брум", "Бэрнсдейл", "Вайонг", "Вангаратта", "Виктор-Харбор",
                                "Вуллонгонг", "Гамильтон", "Гимпи", "Гладстон", "Голд-Кост", "Госфорд", "Гоулберн",
                                "Графтон", "Гриффит", "Даббо", "Данденонг", "Дарвин", "Девонпорт", "Джелонг"))
                ),
                new CountryDoc(
                        "Австрия",
                        "Austria",
                        new ArrayList<>(Arrays.asList("Айзенштадт", "Амштеттен", "Ансфельден", "Бад-Ишль", "Бад-Фёслау",
                                "Баден", "Бишофсхофен", "Блуденц", "Браунау-ам-Инн", "Брегенц", "Брук-ан-дер-Мур",
                                "Брунн-ам-Гебирге", "Вайдхофен-ан-дер-Ибс", "Вайц", "Вальс-Зиценхайм", "Вельс", "Вена",
                                "Винер-Нойштадт", "Вольфсберг", "Вёргль", "Гензерндорф", "Герасдорф-Вин", "Глайсдорф",
                                "Гмунден", "Гратвайн-Штрасенгель", "Грац", "Гросэнцерсдорф", "Гётцис", "Дойчландсберг"))
                ),
                new CountryDoc(
                        "Азербайджан",
                        "Azerbaijan",
                        new ArrayList<>(Arrays.asList("Агдам", "Агдаш", "Агдере", "Агджабеди", "Агстафа", "Аджикабул",
                                "Астара", "Ахсу", "Бабек", "Баку", "Балакен", "Барда", "Бейлаган", "Билясувар", "Габала",
                                "Газах", "Гах", "Геранбой", "Гобустан", "Говлар", "Горадиз", "Губа", "Губадлы", "Гусар",
                                "Гянджа", "Гёйгёль", "Гёйтепе", "Гёйчай", "Далимамедли", "Дашкесан", "Джалилабад",
                                "Джебраил", "Джульфа", "Евлах", "Загатала", "Зангелан", "Зердаб", "Имишли", "Исмаиллы"))
                ),
                new CountryDoc(
                        "Багамские острова",
                        "Bahamas",
                        new ArrayList<>(Arrays.asList("Андрос-Таун", "Артурс-Таун", "Данмор-Таун", "Джордж-Таун",
                                "Кларенс-Таун", "Кокберн-Таун", "Конел-Хилл", "Куперс-Таун", "Марш-Харбор", "Матью-Таун",
                                "Нассау", "Николс-Таун", "Пайратс-Вэлл", "Рок-Саунд", "Свитинг-Кей", "Снаг-Корнер",
                                "Фрипорт", "Фритаун", "Хай-Рок", "Элис-Таун"))
                ),
                new CountryDoc(
                        "Бахрейн",
                        "Bahrain",
                        new ArrayList<>(Arrays.asList("Авали", "Джидд-Хафс", "Мадинат-Иса", "Мадинат-Хамад", "Манама",
                                "Мухаррак", "Ситра", "Эль-Будайи", "Эль-Маликия", "Эль-Хадд", "Эр-Рифа"))
                ),
                new CountryDoc(
                        "Бангладеш",
                        "Bangladesh",
                        new ArrayList<>(Arrays.asList("Бандар", "Барисал", "Бегумгандж", "Богра", "Брахманбария", "Бхайраб",
                                "Газипур", "Дакка", "Джамалпур", "Дженайда", "Джессор", "Динаджпур", "Калиакаир",
                                "Кишоргандж", "Кокс-Базар", "Комилла", "Комилла-Садар-Дакшин", "Куштия", "Кхулна",
                                "Маймансингх", "Навабгандж", "Наогаон", "Нараянгандж", "Нарсингди", "Ноакхали", "Пабна",
                                "Раджшахи", "Рангпур", "Савар", "Саидпур", "Саткхира", "Силхет", "Сираджгандж", "Тангайл"))
                ),
                new CountryDoc(
                        "Барбадос",
                        "Barbados",
                        new ArrayList<>(Arrays.asList("Бриджтаун", "Ойстинс", "Спейтстаун", "Уорренс", "Холтаун"))
                ),
                new CountryDoc(
                        "Беларусь",
                        "Belarus",
                        new ArrayList<>(Arrays.asList("Барановичи", "Барань", "Белоозёрск", "Березино", "Берёза", "Берёзовка",
                                "Бобруйск", "Борисов", "Браслав", "Брест", "Буда-Кошелёво", "Быхов", "Василевичи",
                                "Верхнедвинск", "Ветка", "Вилейка", "Витебск", "Волковыск", "Воложин", "Высокое",
                                "Ганцевичи", "Глубокое", "Гомель", "Горки", "Городок", "Гродно", "Давид-Городок",
                                "Дзержинск", "Дисна", "Добруш", "Докшицы", "Дрогичин", "Дубровно", "Дятлово", "Ельск"))
                ),
                new CountryDoc(
                        "Бельгия",
                        "Belgium",
                        new ArrayList<>(Arrays.asList("Алст", "Ангьен", "Анден", "Анню", "Антверпен", "Антуэн", "Арлон",
                                "Арсхот", "Ат", "Ауденарде", "Ауденбург", "Бастонь", "Бенш", "Беринген", "Билзен",
                                "Бланкенберге", "Бомон", "Борглон", "Борен", "Бре", "Брен-ле-Конт", "Брюгге", "Брюссель",
                                "Буйон", "Вавр", "Валькур", "Варегем", "Варем", "Вервик", "Вервье", "Визе", "Вилворде",
                                "Виртон", "Вёрне", "Гел", "Генк", "Гент", "Герардсберген", "Гистел", "Дамме", "Дейнзе"))
                ),
                new CountryDoc(
                        "Белиз",
                        "Belize",
                        new ArrayList<>(Arrays.asList("Белиз", "Бельмопан", "Бенке-Вьехо-дель-Кармен", "Биг Фолс",
                                "Буэно-Виста", "Гвинея Грасс", "Дангрига", "Джорджевилл", "Коросаль", "Ледивилл",
                                "Литл Белиз", "Маллинс Ривер", "Маскалл", "Медина Банк", "Ориндж-Уолк", "Пласенсия",
                                "Пунта-Горда", "Рок Стон Понд", "Санд-Хилл", "Сан-Игнасио", "Сан-Педро", "Санта-Ана",
                                "Сеайн Байт", "Спаниш Лукаут", "Хаттивилл", "Хопкинс"))
                ),
                new CountryDoc(
                        "Бенин",
                        "Benin",
                        new ArrayList<>(Arrays.asList("Абомей", "Абомей-Калави", "Аллада", "Аплауэ", "Атием", "Баникоара",
                                "Бассила", "Бембереке", "Бетеру", "Боикон", "Бори", "Букумбе", "Ганвье", "Годомей",
                                "Гран-Попо", "Дасса-Зуме", "Джугу", "Догбо-Тота", "Канди", "Керу", "Кету", "Кове", "Коме",
                                "Котону", "Куанде", "Локосса", "Маланвиль", "Натитингу", "Ндали", "Никки", "Параку",
                                "Пеонко", "Побе", "Порга", "Порто-Ново", "Савалу", "Саве", "Сакете", "Сегбана"))
                ),
                new CountryDoc(
                        "Бермудские острова",
                        "Bermuda",
                        new ArrayList<>(Arrays.asList("Гамильтон", "Девоншир", "Пейджет", "Пембрук", "Сандис",
                                "Саутгемптон", "Сент-Джордж", "Сент-Джорджес", "Смитс", "Сомерсет", "Уорик", "Флэттс"))
                ),
                new CountryDoc(
                        "Бутан",
                        "Bhutan",
                        new ArrayList<>(Arrays.asList("Вангди-Пходранг", "Гаса", "Гелепху", "Дагана", "Дампху", "Деотханг",
                                "Джакар", "Жемганг", "Лхунце", "Мебиса", "Монгар", "Паро", "Пемагацел", "Пунакха",
                                "Пхунчхолинг", "Самдруп-Джонгхар", "Самце", "Сарпанг", "Трашиганг", "Трашиянгце",
                                "Тронгса", "Тхимпху", "Хаа", "Цимашам"))
                ),
                new CountryDoc(
                        "Боливия",
                        "Bolivia",
                        new ArrayList<>(Arrays.asList("Андамарка", "Вилья-Монтес", "Вильясон", "Вьяча", "Гуаярамерин",
                                "Кильякольо", "Кобиха", "Колькапируа", "Корке", "Коройко", "Ла-Пас", "Ла-Ривера",
                                "Монтеро", "Оруро", "Поопо", "Потоси", "Пуэрто-Суарес", "Рейес", "Риберальта",
                                "Рурренабаке", "Сабая", "Сакаба", "Санта-Ана-дель-Якума", "Санта-Крус-де-ла-Сьерра",
                                "Сантьяго-де-Уари", "Серрильос", "Сукре", "Тариха", "Толедо", "Тотора", "Тринидад"))
                ),
                new CountryDoc(
                        "Босния и Герцеговина",
                        "Bosnia and Herzegovina",
                        new ArrayList<>(Arrays.asList("Бановичи", "Баня-Лука", "Биелина", "Билеча", "Бихач",
                                "Босанска-Крупа", "Босански-Петровац", "Босанско-Грахово", "Братунац", "Бреза", "Брод",
                                "Брчко", "Бугойно", "Бужим", "Бусовача", "Вареш", "Велика-Кладуша", "Високо", "Витез",
                                "Вишеград", "Власеница", "Вогошча", "Гацко", "Гламоч", "Горажде", "Горни-Вакуф-Ускопле",
                                "Градачац", "Градишка", "Грачаница", "Груде", "Дервента", "Добой", "Домалевац"))
                ),
                new CountryDoc(
                        "Ботсвана",
                        "Botswana",
                        new ArrayList<>(Arrays.asList("Бобононг", "Габороне", "Джваненг", "Канье", "Летлхакане", "Лобаце",
                                "Маун", "Махалапье", "Могодичане", "Молепололе", "Мочуди", "Мошупа", "Палапье", "Рамоцва",
                                "Селеби-Пхикве", "Серове", "Тамага", "Тлоквенг", "Тонота", "Франсистаун"))
                ),
                new CountryDoc(
                        "Бразилия",
                        "Brazil",
                        new ArrayList<>(Arrays.asList("Ананиндеуа", "Анаполис", "Апаресида-ди-Гояния", "Аракажу", "Баруэри",
                                "Бауру", "Белен", "Белу-Оризонти", "Белфорд-Рошу", "Бетин", "Блуменау", "Боа-Виста",
                                "Бразилиа", "Варзеа-Гранди", "Виаман", "Вила-Велья", "Витория", "Витория-да-Конкиста",
                                "Волта-Редонда", "Говернадор-Валадарис", "Гояния", "Граватаи", "Гуаружа", "Гуарульюс",
                                "Диадема", "Дуки-ди-Кашиас", "Жабуатан-дус-Гуарарапис", "Жоинвили", "Жуазейру-ду-Норти"))
                ), new CountryDoc(
                        "Бруней",
                        "Brunei",
                        new ArrayList<>(Arrays.asList("Бангар", "Бандар-Сери-Бегаван", "Джерудонг", "Куала Белайт",
                                "Пекан Тутонг", "Сериа"))
                ),
                new CountryDoc(
                        "Болгария",
                        "Bulgaria",
                        new ArrayList<>(Arrays.asList("Айтос", "Аксаково", "Алфатар", "Антоново", "Априлци", "Ардино",
                                "Асеновград", "Ахелой", "Ахтопол", "Балчик", "Банкя", "Банско", "Баня", "Батак",
                                "Батановци", "Белене", "Белица", "Белово", "Белоградчик", "Белослав", "Берковица",
                                "Благоевград", "Бобов-Дол", "Бобошево", "Божуриште", "Бойчиновци", "Болгарово",
                                "Болярово", "Борово", "Ботевград", "Брацигово", "Брегово", "Брезник", "Брезово"))
                ),
                new CountryDoc(
                        "Буркина-Фасо",
                        "Burkina Faso",
                        new ArrayList<>(Arrays.asList("Банфора", "Батие", "Битту", "Бобо-Диуласо", "Боганде", "Боромо",
                                "Булса", "Буссе", "Вахигуя", "Гава", "Гаранго", "Гурси", "Дано", "Дедугу", "Джибо",
                                "Диебугу", "Дори", "Зиниари", "Зорго", "Кая", "Комбисири", "Конгуси", "Кудугу", "Купела",
                                "Лео", "Манга", "Нуна", "Ньянголоко", "Ородара", "По", "Пуйтенга", "Рео", "Сапуй",
                                "Солензо", "Тенкодого", "Титао", "Тома", "Туган", "Уагадугу", "Уаргайе", "Фада-Нгурма"))
                ),
                new CountryDoc(
                        "Бурунди",
                        "Burundi",
                        new ArrayList<>(Arrays.asList("Бвамбарангве", "Бубанза", "Бурури", "Гатумба", "Гитега", "Гитераньи",
                                "Исале", "Кайогоро", "Каньоша", "Карузи", "Каянза", "Кирундо", "Мабанда", "Макамба",
                                "Матана", "Мваро", "Мугонгоманга", "Муйинга", "Мурамвья", "Нгози", "Руйиги", "Румонге",
                                "Рутана", "Чанкузо", "Чибитоке"))
                ),
                new CountryDoc(
                        "Камбоджа",
                        "Cambodia",
                        new ArrayList<>(Arrays.asList("Банлунг", "Баттамбанг", "Каеп", "Кампонгспы", "Кампонгтхом", "Кампонгтям",
                                "Кампонгчнанг", "Кампот", "Кохконг", "Кратьэх", "Лумпхат", "Пайлин", "Пномпень",
                                "Поусат", "Прейвэнг", "Самроунг", "Свайриенг", "Сенмонором", "Сиануквиль", "Сиемреап",
                                "Сисопхон", "Стынгтраенг", "Такео", "Такмау", "Тбенгминчи"))
                ),
                new CountryDoc(
                        "Камерун",
                        "Cameroon",
                        new ArrayList<>(Arrays.asList("Бали", "Баменда", "Бангангте", "Баньо", "Батури", "Бафанг", "Бафиа",
                                "Бафусам", "Бертуа", "Буэа", "Вум", "Гаруа", "Гаруа Булаи", "Гидер", "Джанг", "Дуала",
                                "Криби", "Кумба", "Кумбо", "Куссери", "Лимбе", "Лум", "Маруа", "Мбальмайо", "Мбанга",
                                "Мбуда", "Мейганга", "Мелонг", "Моколо", "Мора", "Мутенгене", "Нгаундере", "Нконгсамба",
                                "Нкотенг", "Сангмелима", "Тибати", "Тико", "Фумбан", "Фумбот", "Эболова", "Эдеа", "Ягуа",
                                "Яунде"))
                ),
                new CountryDoc(
                        "Канада",
                        "Canada",
                        new ArrayList<>(Arrays.asList("Абботсфорд", "Барри", "Белвилл", "Берлингтон", "Бернаби", "Бленвиль",
                                "Большой Садбери", "Брамптон", "Брантфорд", "Броссар", "Ванкувер", "Виктория",
                                "Виннипег", "Вон", "Вуд-Баффало", "Галифакс", "Гамильтон", "Гатино", "Гранби",
                                "Гранд-Прери", "Графство Страткона", "Гуэлф", "Делта", "Доллар-Дез-Ормо", "Драммондвилл",
                                "Каварта-Лейкс", "Калгари", "Каледон", "Камлупс", "Квебек", "Кеймбридж", "Кейп-Бретон"))
                ),
                new CountryDoc(
                        "Кабо-Верде",
                        "Cape Verde",
                        new ArrayList<>(Arrays.asList("Асомада", "Минделу", "Педра-Бадежу", "Прая", "Сан-Филип",
                                "Санта-Мария", "Таррафал", "Эшпаргуш"))
                ),
                new CountryDoc(
                        "Каймановы острова",
                        "Cayman Islands",
                        new ArrayList<>(Arrays.asList("Бодден-Таун", "Джорджтаун", "Ист-Энд", "Кайман-Брак", "Малый Кайман",
                                "Норт-Сайд", "Уэст-Бей"))
                ),
                new CountryDoc(
                        "Центральноафриканская Республика",
                        "Central African Republic",
                        new ArrayList<>(Arrays.asList("Алиндао", "Бамбари", "Бангасу", "Банги", "Баоро", "Батангафо",
                                "Берберати", "Бимбо", "Бирао", "Боали", "Бода", "Бозум", "Босангоа", "Бриа", "Буар",
                                "Бука", "Гамбо", "Гамбула", "Дамара", "Иппи", "Кабо", "Кага-Бандоро", "Карно", "Кембе",
                                "Куанго", "Мбаики", "Мобае", "Монгумба", "Нделе", "Нола", "Обо", "Пауа", "Рафаи", "Сибю",
                                "Уанго", "Удда", "Яколе"))
                ), new CountryDoc(
                        "Чад",
                        "Chad",
                        new ArrayList<>(Arrays.asList("Абеше", "Ам-Тиман", "Ати", "Бильтин", "Биткине", "Бонгор", "Доба",
                                "Дурбали", "Кело", "Кумра", "Кьябе", "Лаи", "Лере", "Мао", "Массагет", "Монго", "Мунду",
                                "Муссоро", "Нджамена", "Пала", "Сарх", "Ум-Хаджер", "Фая-Ларжо"))
                ),
                new CountryDoc(
                        "Чили",
                        "Chile",
                        new ArrayList<>(Arrays.asList("Альто-Осписио", "Анголь", "Анкуд", "Антофагаста", "Арика", "Батуко",
                                "Буин", "Вальдивия", "Вальенар", "Вальпараисо", "Виктория", "Вильяррика", "Гранерос",
                                "Икике", "Ильяпель", "Калама", "Каньете", "Кастро", "Каукенес", "Кельон", "Кильота",
                                "Кинтеро", "Койайке", "Колина", "Консепсьон", "Конститусьон", "Копьяпо", "Коронель",
                                "Куракави", "Куранилауэ", "Курико", "Ла-Серена", "Ла-Уньон", "Лампа", "Лаутаро", "Лаха"))
                ),
                new CountryDoc(
                        "Китай",
                        "China",
                        new ArrayList<>(Arrays.asList("Аксу", "Алтай", "Аньда", "Анькан", "Аньцин", "Аньцю", "Аньян",
                                "Баодин", "Баоцзи", "Бухэ", "Бэйхай", "Бэнбу", "Бэньси", "Вэйфан", "Ганьчжоу", "Гаосюн",
                                "Гонконг", "Гуанчжоу", "Гуйлинь", "Гуйян", "Гунчжулин", "Гэцзю", "Далянь", "Даньдун",
                                "Датун", "Дунтай", "Дэян", "Жичжао", "Ибинь", "Иньчуань", "Ичан", "Ичунь", "Кайфын",
                                "Карамай", "Карашар", "Кашгар", "Корла", "Коулун", "Кульджа", "Куньмин", "Куча"))
                ),
                new CountryDoc(
                        "Колумбия",
                        "Colombia",
                        new ArrayList<>(Arrays.asList("Армения", "Барранкилья", "Бельо", "Богота", "Букараманга",
                                "Буэнавентура", "Вальедупар", "Вильявисенсио", "Доскебрадас", "Ибаге", "Итагуи", "Кали",
                                "Картахена", "Кукута", "Манисалес", "Медельин", "Монтерия", "Нейва", "Пальмира", "Пасто",
                                "Перейра", "Попаян", "Риоача", "Санта-Марта", "Синселехо", "Соача", "Соледад", "Тулуа",
                                "Тумако", "Флоридабланка", "Энвигадо"))
                ),
                new CountryDoc(
                        "Коморские острова",
                        "Comoros",
                        new ArrayList<>(Arrays.asList("Ада-Двени", "Базимини", "Баракани", "Диндри", "Домони", "Икони",
                                "Кони-Джоджо", "Мбени", "Миронтси", "Мицамиули", "Морони", "Моя", "Муцамуду", "Нгандзале",
                                "Онгужу", "Оункази", "Сима", "Тсимбео", "Уани", "Фомбони"))
                ),
                new CountryDoc(
                        "Коста-Рика",
                        "Costa Rica",
                        new ArrayList<>(Arrays.asList("Алахуэла", "Картаго", "Курридабат", "Либерия", "Лимон", "Никоя",
                                "Пунтаренас", "Сан-Хосе", "Филадельфия"))
                ),
                new CountryDoc(
                        "Кот-д’Ивуар",
                        "Côte d'Ivoire",
                        new ArrayList<>(Arrays.asList("Абенгуру", "Абиджан", "Абоисо", "Агбовиль", "Адзопе", "Аньибилекру",
                                "Аньяма", "Бинжервиль", "Бондуку", "Бонуа", "Буаке", "Буафле", "Бундиали", "Ганьоа",
                                "Гигло", "Гран-Басам", "Дабу", "Далоа", "Данане", "Диво", "Димбокро", "Дуэкуэ", "Зуэнула",
                                "Исиа", "Катиола", "Корого", "Лакота", "Ман", "Одиенне", "Сан-Педро", "Сасандра", "Сегела",
                                "Синфра", "Субре", "Тиасале", "Тингрела", "Тумоди", "Уме", "Феркеседугу", "Ямусукро"))
                ),
                new CountryDoc(
                        "Хорватия",
                        "Croatia",
                        new ArrayList<>(Arrays.asList("Бакар", "Бели-Манастир", "Белишче", "Бенковац", "Биоград-на-Мору",
                                "Буе", "Бузет", "Бьеловар", "Валпово", "Вараждин", "Вараждинске-Топлице", "Велика-Горица",
                                "Винковци", "Вировитица", "Вис", "Водице", "Воднян", "Врбовец", "Врбовско", "Вргорац",
                                "Врлика", "Врсар", "Вуковар", "Гарешница", "Глина", "Госпич", "Грожнян", "Грубишно-Поле",
                                "Дарувар", "Делнице", "Джюрджевац", "Джяково", "Дони-Михоляц", "Доня-Стубица", "Дрниш"))
                ),
                new CountryDoc(
                        "Куба",
                        "Cuba",
                        new ArrayList<>(Arrays.asList("Алькисар", "Артемиса", "Баракоа", "Батабано", "Баута", "Баямо",
                                "Бехукаль", "Варадеро", "Гавана", "Гуанахай", "Гуантанамо", "Гуинес", "Гуира-де-Мелена",
                                "Каймито", "Камагуэй", "Карденас", "Колон", "Консоласьон-дель-Сур", "Контрамаэстре",
                                "Лас-Тунас", "Мадруга", "Мансанильо", "Матансас", "Маяри", "Мелена-дель-Сур", "Моа",
                                "Морон", "Нуэва-Пас", "Нуэва-Херона", "Нуэвитас", "Ольгин", "Пальма-Сорьяно"))
                ),
                new CountryDoc(
                        "Кипр",
                        "Cyprus",
                        new ArrayList<>(Arrays.asList("Агландзия", "Айос-Атанасиос", "Айос-Дометиос", "Арадипу", "Дали",
                                "Ермасойя", "Ипсонас", "Като-Полемидия", "Лакатамия", "Ларнака", "Лация", "Лимасол",
                                "Меса-Йитония", "Никосия", "Паралимни", "Пафос", "Строволос", "Энгоми"))
                ), new CountryDoc(
                        "Чехия",
                        "Czech Republic",
                        new ArrayList<>(Arrays.asList("Абертами", "Адамов", "Андельска-Гора", "Аш", "Баворов",
                                "Баков-над-Йизероу", "Бездружице", "Бела-над-Радбузоу", "Бела-под-Бездезем", "Бельчице",
                                "Бенатки-над-Йизероу", "Бенешов", "Бенешов-над-Плоучници", "Бероун", "Бехине",
                                "Бечов-над-Теплоу", "Бзенец", "Билина", "Биловец", "Бистре", "Бистршице-над-Пернштейнем",
                                "Бистршице-под-Гостинем", "Бланско", "Блатна", "Бловице", "Бльшани", "Богумин"))
                ),
                new CountryDoc(
                        "Демократическая Республика Конго",
                        "Democratic Republic of the Congo",
                        new ArrayList<>(Arrays.asList("Бандунду", "Бома", "Букаву", "Бумба", "Илебо", "Исиро", "Калемие",
                                "Кананга", "Киквит", "Кинду", "Киншаса", "Кисангани", "Китона", "Колвези", "Ликаси",
                                "Лубумбаши", "Матади", "Мбандака", "Мбанза-Нгунгу", "Мбужи-Майи", "Моба", "Мобайе-Мбонго",
                                "Убунду", "Чикапа", "Яяма"))
                ),
                new CountryDoc(
                        "Дания",
                        "Denmark",
                        new ArrayList<>(Arrays.asList("Августенборг", "Аллинге-Сандвиг", "Альбертслунн", "Баллеруп",
                                "Биллунн", "Биркерёд", "Брённерслев", "Вайле", "Варде", "Виборг", "Войенс", "Вордингборг",
                                "Гальтен", "Гесер", "Глоструп", "Города Дании", "Греве Странн", "Грено", "Драгёр",
                                "Дюббёль", "Дюбвад", "Икаст", "Исхой", "Йёрринг", "Калуннборг", "Коккедаль", "Коллинг",
                                "Корсёр", "Кёге", "Лемвиг", "Лиллерёд", "Лёгумклостер", "Марибо", "Марсталь", "Наксков"))
                ),
                new CountryDoc(
                        "Джибути",
                        "Djibouti",
                        new ArrayList<>(Arrays.asList("Алайли-Дадда", "Али-Аддэ", "Али-Сабих", "Арта", "Ас-Эла", "Ассамо",
                                "Бальхо", "Вея", "Годория", "Дадвайя", "Даимоли", "Джибути", "Дикиль", "Дорале", "Дорра",
                                "Думейра", "Йобоки", "Лояда", "Обок", "Ранда", "Рас Сийян", "Сагаллу", "Таджура",
                                "Холь-Холь", "Хор-Ангар", "Шебеллей"))
                ),
                new CountryDoc(
                        "Доминика",
                        "Dominica",
                        new ArrayList<>(Arrays.asList("Аткинсон", "Берекуа", "Вудфорд Хилл", "Калибиши", "Касл-Брюс",
                                "Кейнфилд", "Мао", "Мариго", "Портсмут", "Пуэнт-Мишель", "Розали", "Розо", "Сент-Джозеф",
                                "Солсбери", "Суфриер", "Уэсли"))
                ),
                new CountryDoc(
                        "Доминиканская Республика",
                        "Dominican Republic",
                        new ArrayList<>(Arrays.asList("Асуа-де-Компостела", "Ато-Майор-дель-Реи", "Бани", "Бахос-де-Айна",
                                "Баягуана", "Бока-Чика", "Бонао", "Вилья-Альтаграсия", "Вилья-Бисоно", "Игуэй",
                                "Консепсион-де-ла-Вега", "Констанса", "Консуэло", "Котуи", "Ла-Романа",
                                "Лас-Матас-де-Фарфан", "Лос-Алькаррисос", "Мока", "Нагуа", "Педро-Бранд", "Сан-Кристобаль",
                                "Сан-Педро-де-Макорис", "Сан-Фелипе-де-Пуэрто-Плата", "Сан-Франсиско-де-Макорис"))
                ),
                new CountryDoc(
                        "Восточный Тимор",
                        "East Timor",
                        new ArrayList<>(Arrays.asList("Айлеу", "Айнару", "Баукау", "Бобонару", "Викеке", "Глену", "Дили",
                                "Ликиса", "Лоспалос", "Мальяна", "Манатуту", "Панте Макасар", "Саме", "Суай", "Эрмера"))
                ),
                new CountryDoc(
                        "Эквадор",
                        "Ecuador",
                        new ArrayList<>(Arrays.asList("Амбато", "Бабаойо", "Гуаякиль", "Дауле", "Дуран", "Ибарра",
                                "Кеведо", "Кито", "Куэнка", "Ла-Либертад", "Латакунга", "Лоха", "Манта", "Мачала",
                                "Милагро", "Монтекристи", "Нуэва-Лоха", "Пасахе", "Портовьехо", "Риобамба", "Самборондон",
                                "Сангольки", "Санта-Роса", "Санто-Доминго", "Тулькан", "Уакильяс", "Франсиско-де-Орельяна",
                                "Хипихапа", "Чоне", "Эль-Кармен", "Эсмеральдас"))
                ),
                new CountryDoc(
                        "Египет",
                        "Egypt",
                        new ArrayList<>(Arrays.asList("Абнуб", "Абу-Кебир", "Абу-Куркас", "Абу-Рудейс", "Абу-Тиг", "Абу-Тишт",
                                "Абу-Хаммад", "Абу-Хуммус", "Абу-эль-Матамир", "Ага", "Александрия", "Армант", "Асуан",
                                "Асьют", "Атфих", "Ауляд-Сакр", "Аусим", "Ахмим", "Ашмун", "Бадр", "Балтим", "Басьюн",
                                "Бени-Мазар", "Бени-Суэйф", "Бени-Убейд", "Бенха", "Биба", "Билкас", "Бильбейс",
                                "Бир-эль-Абд", "Биркет-эс-Саб", "Бияла", "Васта", "Гахина", "Гиза", "Гирга"))
                ),
                new CountryDoc(
                        "Сальвадор",
                        "El Salvador",
                        new ArrayList<>(Arrays.asList("Ауачапан", "Кабаньяс", "Кускатлан", "Ла-Либертад", "Ла-Пас",
                                "Ла-Уньон", "Морасан", "Сан-Висенте", "Сан-Мигель", "Сан-Сальвадор", "Санта-Ана",
                                "Сонсонате", "Усулутан", "Чалатенанго"))
                ), new CountryDoc(
                        "Экваториальная Гвинея",
                        "Equatorial Guinea",
                        new ArrayList<>(Arrays.asList("Айене", "Аконибе", "Акуренам", "Анисок", "Бани", "Бата", "Биджабиджан",
                                "Бикурга", "Битика", "Кого", "Кориско", "Луба", "Малабо", "Мачинда", "Мбини",
                                "Менгомейен", "Микомесенг", "Монгомо", "Ниефанг", "Нкими", "Нкуэ", "Нсанг", "Нсок",
                                "Нсорк", "Палеа", "Ребола", "Риаба", "Рио-Кампо", "Эбебьин", "Эвинайонг"))
                ),
                new CountryDoc(
                        "Эритрея",
                        "Eritrea",
                        new ArrayList<>(Arrays.asList("Адди-Куала", "Адди-Кэйих", "Акордат", "Асмэра", "Асэб", "Барэнту",
                                "Бейлуль", "Гинда", "Дэкэмхаре", "Кэрэн", "Массауа", "Мэндэфэра", "Мэрса-Фатма", "Накфа",
                                "Нэфасит", "Сенафе", "Сэгэнэйти", "Тэсэнэй", "Хымбырти", "Эдд"))
                ),
                new CountryDoc(
                        "Эстония",
                        "Estonia",
                        new ArrayList<>(Arrays.asList("Абья-Палуоя", "Антсла", "Валга", "Вильянди", "Выру", "Выхма",
                                "Йыгева", "Йыхви", "Калласте", "Каркси-Нуйа", "Кейла", "Кехра", "Кивиыли", "Килинги-Нымме",
                                "Кохтла-Ярве", "Кунда", "Курессааре", "Кярдла", "Лихула", "Локса", "Маарду", "Муствеэ",
                                "Мыйзакюла", "Нарва", "Нарва-Йыэсуу", "Отепя", "Пайде", "Палдиски", "Пылва", "Пылтсамаа",
                                "Пюсси", "Пярну", "Раквере", "Рапла", "Ряпина", "Сауэ", "Силламяэ", "Синди", "Сууре-Яани"))
                ),
                new CountryDoc(
                        "Эфиопия",
                        "Ethiopia",
                        new ArrayList<>(Arrays.asList("Агаро", "Адди-Грат", "Аддис-Абеба", "Адуа", "Аксум", "Аламата",
                                "Амбо", "Арба-Мынч", "Асэлла", "Бахр-Дар", "Гоба", "Годе", "Гондэр", "Гыйон", "Джиджига",
                                "Джимма", "Дилла", "Дыре-Дауа", "Дэбрэ-Бырхан", "Дэбрэ-Зэйт", "Дэбрэ-Маркос", "Дэбрэ-Табор",
                                "Дэгэх-Бур", "Дэссе", "Йирга-Алем", "Комбольча", "Моджо", "Мэкэле", "Назрет", "Нэгэле",
                                "Нэкэмте", "Роби", "Соддо", "Уольдыя", "Хавасса", "Харэр", "Хосаына", "Шашэмэнне",
                                "Ында-Сылласе"))
                ),
                new CountryDoc(
                        "Федеративные штаты Микронезии",
                        "Federated States of Micronesia",
                        new ArrayList<>(Arrays.asList("Кусаие", "Понпеи", "Чуук", "Яп"))
                ),
                new CountryDoc(
                        "Фиджи",
                        "Fiji",
                        new ArrayList<>(Arrays.asList("Ахау", "Ватукоула", "Вунисеа", "Деумба", "Коровоу", "Короканде",
                                "Ламбаса", "Лами", "Лаутока", "Левука", "Малхаха", "Мба", "Мотуса", "Навоувалу", "Навуа",
                                "Намоси", "Нанди", "Наусори", "Ракираки", "Савусаву", "Сеакака", "Сингатока", "Сува",
                                "Тавуа", "Тумбоу"))
                ),
                new CountryDoc(
                        "Финляндия",
                        "Finland",
                        new ArrayList<>(Arrays.asList("Акаа", "Алавус", "Алаярви", "Вааса", "Валкеакоски", "Вантаа",
                                "Варкаус", "Вийтасаари", "Виррат", "Гуйттинен", "Ийсалми", "Икаалинен", "Иматра",
                                "Йоэнсуу", "Йювяскюля", "Йямся", "Каарина", "Калайоки", "Кангасала", "Канкаанпяа",
                                "Каннус", "Карккила", "Каскинен", "Кауниайнен", "Каухава", "Каухайоки", "Каяани", "Кеми",
                                "Кемиярви", "Керава", "Кеуруу", "Китеэ", "Киурувеси", "Кокемяки", "Коккола", "Котка"))
                ),
                new CountryDoc(
                        "Франция",
                        "France",
                        new ArrayList<>(Arrays.asList("Абвиль", "Азбрук", "Алансон", "Альбервиль", "Амбуаз", "Англет",
                                "Ангулем", "Анже", "Антиб", "Арль", "Байонна", "Баньер-де-Бигор", "Баньоль-сюр-Сез",
                                "Бас-Тер", "Безансон", "Биарриц", "Бове", "Бриансон", "Буживаль", "Булонь-Бийанкур",
                                "Булонь-сюр-Мер", "Валанс", "Валансьен", "Вальмондуа", "Ванв", "Венсен", "Версаль",
                                "Вильжюиф", "Вильнёв-д’Аск", "Витре", "Витри-сюр-Сен", "Виши", "Грас", "Гренобль", "Доль"))
                ),
                new CountryDoc(
                        "Габон",
                        "Gabon",
                        new ArrayList<>(Arrays.asList("Битам", "Буе", "Гамба", "Канго", "Кокобич", "Куламуту", "Ламбарене",
                                "Ластурвиль", "Лекони", "Либревиль", "Макоку", "Маюмба", "Мбигу", "Медунью", "Мекамбо",
                                "Мимонго", "Минвул", "Митзик", "Моанда", "Муила", "Мунана", "Нденде", "Нджоле", "Нкан",
                                "Нтум", "Оем", "Оконджа", "Омбуе", "Порт-Жантиль", "Тсогни", "Франсвиль", "Фугаму",
                                "Чибанга"))
                ),
                new CountryDoc(
                        "Гамбия",
                        "Gambia",
                        new ArrayList<>(Arrays.asList("Бакау", "Бакоте", "Банжул", "Бассе-Санта-Су", "Брикама", "Бруфут",
                                "Гунжур", "Канифинг", "Кололи", "Коту", "Ламин", "Нема-Кунку", "Серекунда", "Сома",
                                "Сукута", "Фарафенни"))
                ),
                new CountryDoc(
                        "Грузия",
                        "Georgia",
                        new ArrayList<>(Arrays.asList("Абаша", "Амбролаури", "Ахалкалаки", "Ахалцихе", "Ахмета", "Багдати",
                                "Батуми", "Болниси", "Боржоми", "Вале", "Вани", "Гардабани", "Гори", "Гурджаани",
                                "Дедоплис-Цкаро", "Джвари", "Дманиси", "Душети", "Зестафони", "Зугдиди", "Карели", "Каспи",
                                "Кварели", "Кобулети", "Кутаиси", "Лагодехи", "Ланчхути", "Марнеули", "Мартвили", "Мцхета",
                                "Ниноцминда", "Озургети", "Они", "Поти", "Рустави", "Сагареджо", "Самтредиа", "Сачхере"))
                ),
                new CountryDoc(
                        "Германия",
                        "Germany",
                        new ArrayList<>(Arrays.asList("Аален", "Аахен", "Абенберг", "Абенсберг", "Абтсвинд", "Абштат",
                                "Августусбург", "Аделебзен", "Адельсдорф", "Адельсрид", "Адельсхофен", "Адельхайдсдорф",
                                "Аденау", "Адендорф", "Адорф", "Азендорф", "Айбельштадт", "Айбеншток", "Айденбах",
                                "Айзельфинг", "Айзенах", "Айзенбах", "Айзенберг", "Айзенхюттенштадт", "Айзеншмит",
                                "Айзлинген", "Айинг", "Айклинген", "Айль", "Айнбек", "Айнринг", "Айслебен", "Айтерн"))
                ),
                new CountryDoc(
                        "Гана",
                        "Ghana",
                        new ArrayList<>(Arrays.asList("Аккра", "Ашаиман", "Ва", "Доме", "Кейп-Кост", "Кофоридуа",
                                "Кумаси", "Лашиби", "Мадина", "Нунгуа", "Обуаси", "Секонди-Такоради", "Суньяни", "Тамале",
                                "Тема", "Тема-Нью-Таун", "Течиман", "Теши", "Хо"))
                ),
                new CountryDoc(
                        "Великобритания",
                        "Great Britan",
                        new ArrayList<>(Arrays.asList("Абераерон", "Абергавенни", "Абергел", "Абердер", "Абердин",
                                "Абердифи", "Абериствит", "Аберлор", "Аберпорт", "Аберсох", "Аберутвен", "Аберфелди",
                                "Абингдон", "Абингтон", "Абон", "Авимор", "Аддербери", "Ай", "Айвичерч", "Айд",
                                "Айл Ман", "Айл оф Арран", "Айл оф Бенбекула", "Айл оф Левис", "Айл оф Мулл",
                                "Айл оф Портланд", "Айлмертон", "Аймут", "Айронбридж", "Акаракл", "Аккрингтон"))
                ),
                new CountryDoc(
                        "Греция",
                        "Greece",
                        new ArrayList<>(Arrays.asList("Абелиона", "Авгонима", "Авлемонас", "Агиа Параскеви", "Агиассос",
                                "Агии Анаргири", "Агии-Апостоли", "Агиос Андреас", "Агиос Атанасиос", "Агиос Георгиос",
                                "Агиос Георгиос Нилиас", "Агиос Димитриос", "Агиос Иоаннис", "Агиос Иоаннис Перистерон",
                                "Агиос Кирикос", "Агиос Лаврентиос", "Агиос Минас", "Агиос Никитас", "Агиос Николаос",
                                "Агиос Петрос", "Агиос Прокопиос", "Агиос Состис", "Агиос Фокас", "Агиос Эмилианос"))
                ),
                new CountryDoc(
                        "Гренада",
                        "Grenada",
                        new ArrayList<>(Arrays.asList("Гранд-Ансе", "Крочу", "Морне-Руж", "Остров Карриаку", "Сент-Джордж",
                                "Сент-Джорджес", "Сент-Дэвид"))
                ),
                new CountryDoc(
                        "Гватемала",
                        "Guatemala",
                        new ArrayList<>(Arrays.asList("Алотенанго", "Антигуа-Гуатемала", "Гватемала", "Изабел", "Панахачель",
                                "Петен", "Пуэрто Сан Хосе", "Пуэрто-Барриос", "Сан-Хосе", "Санта-Катарина Паполо",
                                "Санта-Круз ла-Лагуна", "Солола", "Тикаль", "Флорес", "Чичикастенанго"))
                ), new CountryDoc(
                        "Гвинея-Бисау",
                        "Guinea-Bissau",
                        new ArrayList<>(Arrays.asList("Бафата", "Бисау", "Бисоран", "Болама", "Буба", "Габу", "Катио",
                                "Кашеу", "Кашунго", "Квебо", "Киньямел", "Мансоа", "Фарим"))
                ),
                new CountryDoc(
                        "Гайана",
                        "Guyana",
                        new ArrayList<>(Arrays.asList("Анна-Реджина", "Бартика", "Вред-эн-Хуп", "Джорджтаун", "Дэниелстаун",
                                "Итуни", "Корривертон", "Куинстаун", "Кумака", "Летем", "Линден", "Мабарума", "Мадия",
                                "Махайка", "Махайкони Вилладж", "Нью-Амстердам", "Парадайс", "Парика", "Росигнол",
                                "Роуз Холл", "Скелдон", "Форт Веллингтон", "Шаритей"))
                ),
                new CountryDoc(
                        "Гаити",
                        "Haiti",
                        new ArrayList<>(Arrays.asList("Гонаив", "Дельма", "Кап-Аитьен", "Карфур", "Куа-де-Буке", "Леоган",
                                "Пети-Гоав", "Петьонвиль", "Пор-де-Пе", "Порт-о-Пренс", "Сен-Марк", "Сите-Солей", "Табар"))
                ),
                new CountryDoc(
                        "Гондурас",
                        "Honduras",
                        new ArrayList<>(Arrays.asList("Вильянуэва", "Грасьяс", "Гуаймака", "Данли", "Интибука", "Йоро",
                                "Катакамас", "Комаягуа", "Кофрадиа", "Ла-Лима", "Ла-Пас", "Ла-Сейба", "Ла-Энтрада",
                                "Ла-Эсперанса", "Морасан", "Накаоме", "Нуэва-Окотепеке", "Оланчито", "Потрерильос",
                                "Пуэрто-Кортес", "Пуэрто-Лемпира", "Роатан", "Сан-Лоренсо", "Сан-Педро-Сула",
                                "Санта-Барбара", "Санта-Рита", "Санта-Роса-де-Копан", "Сигуатепеке", "Таланга"))
                ),
                new CountryDoc(
                        "Венгрия",
                        "Hungary",
                        new ArrayList<>(Arrays.asList("Агард", "Агфальва", "Айка", "Алшоерш", "Алшопахок", "Ашотхалом",
                                "Бадачонь", "Бадачоньтомай", "Байя", "Баконибел", "Балатонакали", "Балатоналмади",
                                "Балатонбоглар", "Балатонвилагош", "Балатондьёрок", "Балатонжаржо", "Балатонкенеше",
                                "Балатонкерештур", "Балатонлелле", "Балатонмариафюрдё", "Балатонсемеш", "Балатонфельдвар",
                                "Балатонфенивес", "Балатонфюред", "Балатонёсёд", "Балмазуйвароше", "Банк", "Бекешчаба"))
                ),
                new CountryDoc(
                        "Исландия",
                        "Iceland",
                        new ArrayList<>(Arrays.asList("Акранес", "Акюрейри", "Боргарнес", "Боргарфьордур Эйстри", "Бреиддэлсвик",
                                "Будардалур", "Вармальо", "Вестманские Острова", "Вогар", "Вопнафйордур", "Гардур",
                                "Гриндавик", "Грюндарфьордур", "Далвик", "Исафьордур", "Кефлавик", "Киркьюбайарклёйстур",
                                "Копавогур", "Лаугар", "Логэр", "Миват", "Мосфелльсбаер", "Нескаупстадур", "Олафсвик",
                                "Олаффьордур", "Ореафи", "Рейдарфьордур", "Рейкхольт", "Рейкъявик", "Селфосс", "Скогар"))
                ),
                new CountryDoc(
                        "Индия",
                        "India",
                        new ArrayList<>(Arrays.asList("Агартала", "Агра", "Аджмер", "Акола", "Алвар", "Алибаг", "Аллахабад",
                                "Аллеппи", "Алмора", "Алсисар", "Амбала", "Амритсар", "Анджуна", "Анклешвар", "Арамболь",
                                "Аули", "Аурангабад", "Ахмадабад", "Бага", "Бадами", "Бадди", "Бадринат", "Балагхат",
                                "Балрампур", "Бамболим", "Бамбора", "Бангалор", "Бандипур", "Бандхавгарх", "Баратан",
                                "Бардез", "Барейли", "Батинда", "Бекал", "Белгаум", "Беллари", "Бенаулим", "Беталбатим"))
                ),
                new CountryDoc(
                        "Индонезия",
                        "Indonesia",
                        new ArrayList<>(Arrays.asList("Амбон", "Амлапура", "Аньер", "Баликпапан", "Банда Асе",
                                "Бандар Лампунг", "Банджарбару", "Бандунг", "Бантул", "Баньюванги", "Баньярмасин",
                                "Батам", "Бату", "Бекаси", "Бенгкулу", "Берастаги", "Биак", "Бима", "Бинтан", "Битунг",
                                "Блитар", "Богор", "Бондовосо", "Букиттингги", "Вамена", "Вонособо", "Вори", "Гарут",
                                "Гили Траванган", "Горонтало", "Дели Серданг", "Денпасар", "Депок", "Джакарта", "Джамби"))
                ),
                new CountryDoc(
                        "Иран",
                        "Iran",
                        new ArrayList<>(Arrays.asList("Абадан", "Арак", "Ахваз", "Бандар-Абас", "Захедан", "Исфахан",
                                "Караи", "Керман", "Керманшах", "Киш Исланд", "Кум", "Мешхед", "Персеполь", "Рамсар",
                                "Сари", "Тебриз", "Тегеран", "Хамадан", "Чалус", "Шехре-Корд", "Шираз", "Язд", "Ясудж"))
                ), new CountryDoc(
                        "Ирак",
                        "Iraq",
                        new ArrayList<>(Arrays.asList("Багдад", "Басра", "Вавилон", "Кербела", "Киркук", "Мосул",
                                "Сулеймания"))
                ),
                new CountryDoc(
                        "Ирландия",
                        "Ireland",
                        new ArrayList<>(Arrays.asList("Аббилиш", "Аббифил", "Авока", "Адар", "Аллихис", "Анаскол", "Ардар",
                                "Ардмор", "Арклоу", "Аскитон", "Атбой", "Атенрай", "Ати", "Атлиг", "Атлон", "Ашборн",
                                "Балбригган", "Балингери", "Баллагадеррин", "Баллибогил", "Баллибунион", "Балливон",
                                "Балливурни", "Баллиголи", "Балликистин", "Балликоннел", "Баллилики", "Баллилиффин",
                                "Баллина", "Баллинабула", "Баллинамор", "Баллинасло", "Баллиндерри", "Баллинскеллигс"))
                ),
                new CountryDoc(
                        "Израиль",
                        "Israel",
                        new ArrayList<>(Arrays.asList("Акко", "Алмагор", "Альмог", "Амация", "Амиад", "Амирим", "Арад",
                                "Арбел", "Аррабе", "Ашдод", "Ашдот Яаков Ихуд", "Ашкелон", "Бат-Ям", "Бейт Орен",
                                "Бейт Хиллел", "Беэр Яаков", "Беэр-Шева", "Веред ха-Галиль", "Вифлеем", "Гейрцлия",
                                "Гешер-ХаЗив", "Гиносар", "Голанские Высоты", "Гонен", "Дегания Бет", "Димона", "Дор",
                                "Ехуд", "Зихрон Яаков", "Иве-Иехуда", "Иерусалим", "Йесуд Гамаала", "Катцрин", "Кейсария"))
                ),
                new CountryDoc(
                        "Италия",
                        "Italy",
                        new ArrayList<>(Arrays.asList("Абано-Терме", "Аббадия Лариана", "Аббадия-Сан-Сальваторе", "Аббазанта",
                                "Аббиатеграссо", "Абетоне", "Авеленго", "Авеллино", "Аверса", "Аветрана", "Авеццано",
                                "Авиано", "Авильяна", "Авильяно Умбро", "Авола", "Аграте-Брианца", "Аграте-Контурбия",
                                "Агридженто", "Агрополи", "Аджерола", "Адрано", "Азиаго", "Азоло", "Айас", "Айдоне",
                                "Акате", "Аквавива-Пичена", "Акваспарта", "Акведольчи", "Акви-Терме", "Аквилея"))
                ),
                new CountryDoc(
                        "Ямайка",
                        "Jamaica",
                        new ArrayList<>(Arrays.asList("Бенгал", "Дискавери Бей", "Дрейперс", "Дунканс", "Зеленый остров",
                                "Кингстон", "Лусеа", "Мандевилл", "Монтего-Бей", "Негрил", "Оракобесса", "Очо-Риос",
                                "Петерсфилд", "Порт-Антонио", "Порт-Мария", "Ранэуэй Бэй", "Рио-Буэно", "Сен-Мари",
                                "Сент Элизабет", "Сент-Энн Бей", "Спэниш-Таун", "Треже-Бич", "Трелавни", "Уэстморленд",
                                "Фалмут", "Христиана"))
                ),
                new CountryDoc(
                        "Япония",
                        "Japan",
                        new ArrayList<>(Arrays.asList("Абашири", "Аважи", "Авара", "Аджео", "Аджигасава", "Азумино", "Аиои",
                                "Айдзувакаматсу", "Акаиси", "Акайгава", "Акаси", "Акисима", "Акита", "Ако", "Амагасаки",
                                "Амакуса", "Амами", "Ами", "Анан", "Анжо", "Аннака", "Аомори", "Арао", "Асакура",
                                "Асахикава", "Асо", "Атами", "Ацуги", "Ачи", "Ашикага", "Бандай", "Беппу", "Биеи",
                                "Вадзима", "Вакаяма", "Вакканай", "Вако", "Гамагори", "Геро", "Гинован", "Гифу"))
                ),
                new CountryDoc(
                        "Иордания",
                        "Jordan",
                        new ArrayList<>(Arrays.asList("Ад-Дулайл", "Аджлун", "Азми эль-Муфти", "Айдун", "Айн эль-Баша",
                                "Акаба", "Амман", "Ар-Русайфа", "Ас-Сарих", "Ас-Хусун", "Аскан Абу Нусайр", "Байт Рас",
                                "Вади ас-Сир", "Гавр аш-Шафи", "Джараш", "Ирбид", "Кураима", "Куфриндша", "Маан", "Мадаба",
                                "Мардш эль-Хамам", "Мучаям Хеттен", "Наур", "Сахаб", "Сувайлих", "Тила эль-Али", "Ум Кес",
                                "Хурайбат ас-Сук", "Шафа Бадран", "Эз-Зарка", "Эль-Бака", "Эль-Джубейха", "Эль-Карак"))
                ),
                new CountryDoc(
                        "Казахстан",
                        "Kazakhstan",
                        new ArrayList<>(Arrays.asList("Абай", "Акколь", "Аксай", "Аксу", "Актау", "Актобе", "Алга",
                                "Алматы", "Алтай", "Арал", "Аркалык", "Арыс", "Астана", "Атбасар", "Атырау", "Аягоз",
                                "Байконыр", "Балхаш", "Булаево", "Державинск", "Ерейментау", "Есик", "Есиль", "Жанаозен",
                                "Жанатас", "Жаркент", "Жезказган", "Жем", "Жетысай", "Житикара", "Зайсан", "Казалинск",
                                "Кандыагаш", "Караганды", "Каражал", "Каратау", "Каркаралинск", "Каскелен", "Кентау"))
                ),
                new CountryDoc(
                        "Кения",
                        "Kenya",
                        new ArrayList<>(Arrays.asList("Аваси", "Бомет", "Бунгома", "Бусиа", "Ваджир", "Вебуай", "Вихига",
                                "Вои", "Воут", "Гарисса", "Гилгил", "Жужа", "Исиоло", "Какамега", "Капенгуриа", "Капсабет",
                                "Карури", "Керико", "Киамбу", "Кизий", "Кикую", "Килифи", "Кимилили", "Кисуму", "Китале",
                                "Китуи", "Кутус", "Ламу", "Лимара", "Литейн", "Лодвар", "Мавоко", "Макуени", "Малинди",
                                "Мандера", "Маралал", "Мачакос", "Меру", "Мигори", "Млолонго", "Моло", "Момбаса", "Мояле"))
                ),
                new CountryDoc(
                        "Косово",
                        "Kosovo",
                        new ArrayList<>(Arrays.asList("Витина", "Вучитрн", "Глоговац", "Гнилане", "Дечани", "Джяковица",
                                "Драгаш", "Звечан", "Исток", "Качаник", "Клина", "Косово-Поле", "Косовска-Каменица",
                                "Косовска-Митровица", "Лепосавич", "Лешак", "Липлян", "Малишево", "Обилич", "Ораховац",
                                "Печ", "Подуево", "Призрен", "Приштина", "Србица", "Сува-Река", "Урошевац", "Штимле",
                                "Штрпце"))
                ), new CountryDoc(
                        "Кувейт",
                        "Kuwait",
                        new ArrayList<>(Arrays.asList("Джабер-эль-Ахмад", "Джануб-эль-Кувейт", "Манкаф", "Мубарак аль-Кабир",
                                "Мубарак-эс-Сабах", "Сабах-эс-Салим", "Хавалли", "Эль-Ахмади", "Эль-Джахра ", "Эль-Кувейт",
                                "Эль-Фарвания", "Эль-Финтас", "Эль-Фирдаус", "Эс-Сулайбихат", "Эс-Сулайбия", "Эш-Шуаиба"))
                ),
                new CountryDoc(
                        "Кыргызстан",
                        "Kyrgyzstan",
                        new ArrayList<>(Arrays.asList("Айдаркен", "Ак-Суу", "Балыкчы", "Баткен", "Бишкек", "Джалал-Абад",
                                "Кадамжай", "Каинды", "Кант", "Кара-Балта", "Кара-Куль", "Кара-Суу", "Каракол", "Кемин",
                                "Кербен", "Кок-Джангак", "Кочкор-Ата", "Кызыл-Кия", "Майлуу-Суу", "Нарын", "Ноокат",
                                "Орловка", "Ош", "Раззаков", "Сулюкта", "Талас", "Таш-Кумыр", "Токмак", "Токтогул",
                                "Узген", "Чолпон-Ата", "Шопоков"))
                ),
                new CountryDoc(
                        "Лаос",
                        "Laos",
                        new ArrayList<>(Arrays.asList("Вангвьенг", "Вьентьян", "Лаксао", "Луангнамтха", "Луангпхабанг",
                                "Муангсай", "Намбак", "Паклай", "Паксан", "Паксе", "Пхонсаван", "Пхонтхонг", "Пхонхонг",
                                "Пхьянг", "Саваннакхет", "Сайнябули", "Секонг", "Сено", "Тхакхэк", "Хуайсай"))
                ),
                new CountryDoc(
                        "Латвия",
                        "Latvia",
                        new ArrayList<>(Arrays.asList("Ада", "Адажи", "Айзкраукле", "Айзпуте", "Айнажи", "Акнисте", "Алоя",
                                "Алуксне", "Амата", "Апе", "Апшуциемс", "Ауце", "Балви", "Балдоне", "Баложи", "Балтезерс",
                                "Бауска", "Броцены", "Валдемарпилс", "Валка", "Валмиера", "Вангажи", "Варакляны",
                                "Вентспилс", "Вестиена", "Виесите", "Виляка", "Виляны", "Гаркалне", "Гробиня", "Гулбене",
                                "Дагда", "Даугавпилс", "Дзербене", "Добеле", "Дурбе", "Екабпилс", "Елгава", "Зилупе"))
                ),
                new CountryDoc(
                        "Ливан",
                        "Lebanon",
                        new ArrayList<>(Arrays.asList("Адма", "Алей", "Амион", "Баабда", "Баальбек", "Бамдоун", "Батрун",
                                "Бейрут", "Бейт Мери", "Бейт-Эль-Дин", "Бзуммар", "Библ", "Бишари", "Бруммана",
                                "Вауш-Бейрут", "Дбайе", "Джеззин", "Джоунье", "Джубб-Джаннин", "Джувейя", "Дума",
                                "Духур эль-Шуэр", "Захла", "Згарта", "Зук-Микаэль", "Ибейль-Библос", "Кфар Дебиане",
                                "Кфардебьяне", "Маамельтейн", "Мердж-Аюн", "Мтолле", "Рашайя", "Раяк", "Саида", "Сайда"))
                ),
                new CountryDoc(
                        "Лесото",
                        "Lesotho",
                        new ArrayList<>(Arrays.asList("Бутха-Бутхе", "Мапуцоэ", "Масеру", "Мафетенг", "Мокхотлонг",
                                "Мохалес-Хук", "Теятеяненг", "Тхаба-Цека", "Хлоце", "Цгачас-Нек", "Цгутхинг"))
                ),
                new CountryDoc(
                        "Либерия",
                        "Liberia",
                        new ArrayList<>(Arrays.asList("Барклайвилл", "Бенсонвилл", "Бополу", "Бьюкенен", "Воинджама",
                                "Ганта", "Гбарнга", "Гринвилл", "Зведру", "Зорзор", "Каката", "Карнплэй", "Кестос-Сити",
                                "Монровия", "Плибо", "Ривер-Гбе", "Робертспорт", "Саклейпи", "Санникелли", "Тубманбург",
                                "Фиштаун", "Фойа", "Харбел", "Харпер"))
                ),
                new CountryDoc(
                        "Ливия",
                        "Libya",
                        new ArrayList<>(Arrays.asList("Адждабия", "Аубари", "Бадр", "Бенгази", "Бени-Валид", "Брак",
                                "Гадамес", "Гарьян", "Дерна", "Завият-Бишара", "Зувара", "Каср-Ахмед", "Марзук", "Мизда",
                                "Мисрата", "Налут", "Рас-эль-Ануф", "Сабра", "Сабха", "Сиди-Бу-Зина", "Сурман", "Сурт",
                                "Тархуна", "Тиджи", "Тобрук", "Триполи", "Тукра", "Уаддан", "Хомс", "Хун", "Шаххат",
                                "Эз-Завия", "Эз-Зинтан", "Эль-Абьяр", "Эль-Аджейлат", "Эль-Байда", "Эль-Джауф"))
                ),
                new CountryDoc(
                        "Лихтенштейн",
                        "Liechtenstein",
                        new ArrayList<>(Arrays.asList("Бальцерс", "Бендерн", "Вадуц", "Вангерберг", "Гамприн", "Гафлай",
                                "Замина", "Зилум", "Зюкка", "Мазеша", "Мальбун", "Маурен", "Мельс", "Мюлехольц",
                                "Нендельн", "Планкен", "Ротенбоден", "Руггелль", "Тризен", "Тризенберг",
                                "Хинтер-Шелленберг", "Шан", "Шанвальд", "Шелленберг", "Штег", "Эбенхольц",
                                "Эшен"))
                ),
                new CountryDoc(
                        "Литва",
                        "Lithuania",
                        new ArrayList<>(Arrays.asList("Акмяне", "Алитус", "Аникщяй", "Арёгала", "Балтойи-Воке", "Биржай",
                                "Бирштонас", "Вабальнинкас", "Варена", "Варняй", "Вевис", "Вейсеяй", "Векшняй",
                                "Вилкавишкис", "Вилькия", "Вильнюс", "Вирбалис", "Висагинас", "Вянта", "Гаргждай",
                                "Гарлява", "Григишкес", "Гялгаудушкис", "Даугай", "Друскининкай", "Дукштас", "Дусятос",
                                "Езнас", "Жагаре", "Жежмаряй", "Зарасай", "Игналина", "Йонава", "Йонишкелис", "Йонишкис"))
                ), new CountryDoc(
                        "Люксембург",
                        "Luxembourg",
                        new ArrayList<>(Arrays.asList("Вианден", "Вильц", "Гревенмахер", "Дикирх", "Дифферданж", "Дюделанж",
                                "Люксембург", "Ремих", "Рюмеланж", "Эттельбрюк", "Эхтернах", "Эш-сюр-Альзетт"))
                ),
                new CountryDoc(
                        "Мадагаскар",
                        "Madagascar",
                        new ArrayList<>(Arrays.asList("Алацинайни-Иаламарина", "Амбалавау", "Амбанья", "Амбатулампи",
                                "Амбатундразака", "Амбенья", "Амбилубе", "Амбувумбе", "Амбуситра", "Амбухимахамасина",
                                "Амбухимахасуа", "Ампарафаравола", "Ампарихи-Бейофо", "Ампитсикинама", "Ампумбиантамбу",
                                "Андапа", "Анталаха", "Антананариву", "Антанифуци", "Анцирабе", "Анциранана", "Анцухихи",
                                "Аривунимаму", "Бетрука", "Бефандриана-Аварарта", "Буризини", "Вангайдрану", "Ватумайндри"))
                ),
                new CountryDoc(
                        "Малави",
                        "Malawi",
                        new ArrayList<>(Arrays.asList("Балака", "Блантайр", "Зомба", "Каронга", "Касунгу", "Ливонде",
                                "Лилонгве", "Лученза", "Мангоче", "Мзимба", "Мзузу", "Муландже", "Мчинджи", "Нсанье",
                                "Нхотакота", "Нчеу", "Румфи", "Салима"))
                ),
                new CountryDoc(
                        "Малайзия",
                        "Malaysia",
                        new ArrayList<>(Arrays.asList("Айер Керо", "Алор-Сетар", "Баган-Датох", "Бандар Пенавар",
                                "Бандар-Бару Банги", "Бантинг", "Баттерворт", "Бату Кейвс", "Бату Паха", "Бату Ферринги",
                                "Бентонг", "Бинтулу", "Бринчанг", "Букит-Тингги", "Вакаф Че Йех", "Гентинг Хайлэндc",
                                "Герик", "Гопенг", "Гуа Мусанг", "Гурун", "Джанда Баик", "Джасин", "Джерантут", "Джитра",
                                "Джорджтаун", "Джохор-Бару", "Джохор-лама", "Жереяк", "Ипох", "Кайянг", "Каки Букит"))
                ),
                new CountryDoc(
                        "Мальдивы",
                        "Maldives",
                        new ArrayList<>(Arrays.asList("Алифуши", "Вейманду", "Виллингили", "Ган", "Дидду", "Ихавандхоо",
                                "Кудахувадхоо", "Кулхудуффуши", "Маафуши", "Мале", "Манаду", "Марадхоо", "Махибадхоо",
                                "Мули", "Наифару", "Ниландхоо", "Расдхоо", "Тхинадхоо", "Тхулусдхоо", "Унгоофаару",
                                "Фейдхоо", "Фонадхоо", "Фувахмулах", "Фулидхоо", "Фунадхоо", "Хиннавару", "Хитхадхоо",
                                "Хоарафуши", "Хулхумале", "Эйдхафуши"))
                ),
                new CountryDoc(
                        "Мали",
                        "Mali",
                        new ArrayList<>(Arrays.asList("Араван", "Бамако", "Банамба", "Бандиагара", "Бафулабе", "Бугуни",
                                "Гао", "Гундам", "Дженне", "Дире", "Дуентца", "Йоросо", "Каес", "Кангаба", "Кати",
                                "Кидаль", "Кимпарана", "Кита", "Колокани", "Куликоро", "Кутиала", "Маркала", "Мопти",
                                "Нара", "Нионо", "Ниоро", "Сан", "Сегу", "Сикасо", "Соколо", "Тауденни", "Тененку",
                                "Тесалит", "Томбукту"))
                ),
                new CountryDoc(
                        "Мальта",
                        "Malta",
                        new ArrayList<>(Arrays.asList("Айнсилем", "Арб", "Асри", "Аттард", "Аура", "Бирзеббуджа", "Биркиркара",
                                "Бормла", "Буджибба", "Бухта Сан Пауль", "Валлетта", "Виктория", "Гзира", "Голден Бей",
                                "Заббар", "Зеббудж", "Зейтун", "Зуррик", "Кала", "Калькара", "Комино", "Корми", "Лука",
                                "Марса", "Марсалфорн", "Марсаскала", "Марсашлокк", "Марфа", "Мдина", "Меллиеха", "Меллиха",
                                "Моста", "Мсида", "Муншар", "Нашшар", "Паола", "Пейсвилл", "Пемброке", "Рабат"))
                ),
                new CountryDoc(
                        "Мавритания",
                        "Mauritania",
                        new ArrayList<>(Arrays.asList("Адель-Багру", "Акжужт", "Алег", "Атар", "Аужефт", "Аюн-эль-Атрус",
                                "Бабабе", "Баркевол", "Бассикуну", "Бирмогурен", "Боге", "Бустий", "Бутилимит",
                                "Вали Джантанг", "Геру", "Джигуенни", "Джоволь", "Зуэрат", "Канкосса", "Каэди", "Киффа",
                                "Кобенни", "Лекесиба", "Магама", "Магта-Лахжар", "Мбера", "Мбут", "Медердра", "Монгуэль",
                                "Нема", "Нуадибу", "Нуакшот", "Росо", "Селибаби", "Тамшакет", "Тиджикжа", "Тимбедра"))
                ),
                new CountryDoc(
                        "Маврикий",
                        "Mauritius",
                        new ArrayList<>(Arrays.asList("Бамбу", "Бе-дю-Томбо", "Бель-Эр", "Бо-Бассен-Роз-Хилл", "Вакоас-Финикс",
                                "Гранд-Бе", "Гудлендс", "Катр-Борн", "Кмен-Гренье", "Кьюрпайп", "Ле-Оше", "Маэбур",
                                "Нью-Гроув", "Порт-Луи", "Ривьер-дю-Рампар", "Роз-Бель", "Сантр-де-Флак", "Сен-Пьер",
                                "Тер-Руж", "Триоле"))
                ),
                new CountryDoc(
                        "Мексика",
                        "Mexico",
                        new ArrayList<>(Arrays.asList("Абасоло", "Агуа-Дульсе", "Агуа-Приета", "Агуалегуас", "Агуаскальентес",
                                "Акалтан-де-Перес-Фигероа", "Акамбаро", "Акансех", "Акапонета", "Акапулько",
                                "Акатлан-де-Хуарес", "Акаюкан", "Акончи", "Актопан", "Акумал", "Аламос", "Альварадо",
                                "Альенде", "Альтамира", "Альтар", "Альтотонга", "Амакусак", "Аматитан", "Аматлан",
                                "Амеалько", "Амеалько-де-Бонфиль", "Амека", "Амекамека", "Ангостура", "Антигуо-Морелос"))
                ), new CountryDoc(
                        "Молдова",
                        "Moldova",
                        new ArrayList<>(Arrays.asList("Атаки", "Бельцы", "Бендеры", "Бессарабка", "Бируинца", "Бричаны",
                                "Быковец", "Вадул-луй-Водэ", "Ватра", "Вулканешты", "Гиндешты", "Глодяны", "Григориополь",
                                "Днестровск", "Дондюшаны", "Дрокия", "Дубоссары", "Дурлешты", "Единец", "Кагул",
                                "Каинары", "Калараш", "Каменка", "Кантемир", "Кишинёв", "Кодру", "Комрат", "Корнешты",
                                "Костешты", "Красное", "Криково", "Криулень", "Купчинь", "Кэушень", "Леова", "Липканы"))
                ),
                new CountryDoc(
                        "Монако",
                        "Monaco",
                        new ArrayList<>(Arrays.asList("Монако", "Монако-Вилль", "Монте-Карло"))
                ),
                new CountryDoc(
                        "Монголия",
                        "Mongolia",
                        new ArrayList<>(Arrays.asList("Алтай", "Алтанбулаг", "Арвайхээр", "Багануур", "Баруун-Урт",
                                "Бат-Улзий", "Баянхонгор", "Булган", "Бурдэ", "Бэрх", "Даланзадгад", "Дархан", "Замын-Уудэ",
                                "Зуунмод", "Каракорум", "Мурэн", "Налайх", "Сайншанд", "Сухэ-Батор", "Улаангом",
                                "Улан-Батор", "Улгий", "Улиастай", "Ховд", "Цэцэрлэг", "Чингис", "Чойбалсан", "Чойр",
                                "Шарынгол", "Эрдэнэт"))
                ),
                new CountryDoc(
                        "Черногория",
                        "Montenegro",
                        new ArrayList<>(Arrays.asList("Андриевица", "Бар", "Беране", "Биело-Поле", "Будва", "Даниловград",
                                "Жабляк", "Колашин", "Котор", "Мойковац", "Никшич", "Плав", "Плевля", "Плужине", "Подгорица",
                                "Рожае", "Тиват", "Улцинь", "Херцег-Нови", "Цетине", "Шавник"))
                ),
                new CountryDoc(
                        "Марокко",
                        "Morocco",
                        new ArrayList<>(Arrays.asList("Агадир", "Аземмур", "Азилаль", "Азру", "Аль-Аруи", "Бен-Герир",
                                "Бен-Слиман", "Бени-Меллаль", "Беркан", "Беррешид", "Биугра", "Буджад", "Варзазат",
                                "Герсиф", "Гулимин", "Джерада", "Загора", "Касабланка", "Касба-Тадла", "Кенитра", "Лараш",
                                "Лекльяа", "Марракеш", "Мартиль", "Мдик", "Мекнес", "Мидельт", "Мохаммедия", "Мрирт",
                                "Надор", "Рабат", "Сафи", "Сеттат", "Сефру", "Сиди-Беннур", "Сиди-Касем", "Сиди-Слиман"))
                ),
                new CountryDoc(
                        "Мозамбик",
                        "Mozambique",
                        new ArrayList<>(Arrays.asList("Ангоше", "Бейра", "Виланкулуш", "Гаруэ", "Гондола", "Гуруэ", "Дондо",
                                "Иньямбане", "Катандика", "Келимане", "Куамба", "Лишинга", "Манжаказе", "Маника", "Мапуту",
                                "Масиа", "Матола", "Машише", "Моатизе", "Мозамбик", "Мокуба", "Монапо", "Монтепуэш",
                                "Мосимбоа-да-Прая", "Мутуали", "Накала", "Намиало", "Нампула", "Пемба", "Тете", "Улонгуэ",
                                "Шаи-Шаи", "Шибуто", "Шимойо", "Шокве"))
                ),
                new CountryDoc(
                        "Мьянма",
                        "Myanmar",
                        new ArrayList<>(Arrays.asList("Ава", "Акьяб", "Алланмьё", "Амарапура", "Аракан", "Бамо", "Бассейн",
                                "Богале", "Е", "Енанджаун", "Калемьо", "Канбе", "Лашо", "Лойко", "Магуэ", "Мандалай",
                                "Маубин", "Мейтхила", "Мемьо", "Минбу", "Мингун", "Могоу", "Моулмейн", "Моунъюа",
                                "Мраук-У", "Мудоун", "Мьей", "Мьинджан", "Мьичина", "Найпьидо", "Ньяунг-Шве", "Ньяунлебин",
                                "Паан", "Паган", "Пакхоуку", "Пегу", "Пхьяпоун", "Пьи", "Пьинмана", "Рангун", "Сагайн"))
                ),
                new CountryDoc(
                        "Намибия",
                        "Namibia",
                        new ArrayList<>(Arrays.asList("Виндхук", "Гочас", "Дамараленд", "Каманджаб", "Каприви",
                                "Катима-Мулило", "Китмансхуп", "Людериц", "Мариентал", "Намиб", "Омаруру", "Ондангва",
                                "Опуво", "Оучо", "Очиваронго", "Ошакати", "Ритог", "Рунду", "Свакопмунд", "Сесрием",
                                "Соссусфлей", "Уолвис Бей", "Фиш Ривер Каньон", "Хентис Бей", "Цумеб", "Этоша"))
                ),
                new CountryDoc(
                        "Непал",
                        "Nepal",
                        new ArrayList<>(Arrays.asList("Аттария", "Банганга", "Бирендранагар", "Бхактапур", "Гадхимай",
                                "Горкха", "Гулария", "Гхорахи", "Дамак", "Даман", "Джуликхел", "Джхавани", "Калайя",
                                "Катманду", "Киртипур", "Кохалпур", "Ламки Чуха", "Лахан", "Лекхнат", "Лумбини", "Малакшми",
                                "Нагарджун", "Нагаркот", "Непалгандж", "Патан", "Покхара", "Ратнанагар", "Сиддхартханагар",
                                "Таракешвар", "Тикапур", "Токха", "Триюга", "Тулсипур", "Чандранигахапур", "Читуань"))
                ),
                new CountryDoc(
                        "Нидерланды",
                        "Netherlands",
                        new ArrayList<>(Arrays.asList("Абкауде", "Акрюм", "Алкмар", "Алмело", "Алмен", "Алмере", "Алсмер",
                                "Алфен на Ауде Рейн", "Амеланд", "Амерсфорт", "Амстелвен", "Амстердам", "Андейк",
                                "Андерен", "Анкевен", "Анло", "Анна Павловна", "Аннен", "Апельдорн", "Аппелша", "Аппельтерн",
                                "Аппингедам", "Арденбург", "Арич", "Арнем", "Арсен", "Артсвуд", "Арум", "Ассен", "Ассенделфт",
                                "Астен", "Ауде Билтзейл", "Ауденбос", "Аудеркерк-аан-де-Амстел", "Аудесхип", "Аудкерк"))
                ), new CountryDoc(
                        "Новая Зеландия",
                        "New Zealand",
                        new ArrayList<>(Arrays.asList("Акароа", "Алегзандра", "Аппер Муатер", "Аппер-Хатт", "Артурс-Пасс",
                                "Атенри", "Ахипара", "Бленэйм", "Брус-Бей", "Ваихи", "Ваихи-Бич", "Вайкава", "Вайканае",
                                "Ванака", "Вангамата", "Вангануи", "Ваюку", "Веллингтон", "Велсфорд", "Витианга",
                                "Вонгапароа", "Гамильтон", "Гастингс", "Гисборн", "Гленорчи", "Голден-Бэй", "Гор",
                                "Греймут", "Грейтаун", "Данидин", "Даргавилл", "Джеральдин", "Инверкаргилл", "Кавау"))
                ),
                new CountryDoc(
                        "Никарагуа",
                        "Nicaragua",
                        new ArrayList<>(Arrays.asList("Блуфилдс", "Боако", "Гранада", "Дириамба", "Камоапа", "Кондега",
                                "Коринто", "Ла-Консепсьон", "Ла-Пас-Сентро", "Ла-Тринидад", "Ларрейнага", "Леон",
                                "Манагуа", "Масатепе", "Масая", "Матагальпа", "Матеаре", "Нагароте", "Нандаиме",
                                "Ниндирини", "Нуэва-Гвинея", "Окоталь", "Пуэрто-Кабесас", "Ривас", "Рио-Бланко",
                                "Сан-Карлос", "Сан-Маркос", "Сан-Рафаэль-дель-Сюр", "Санто-Томас", "Себако", "Сиуна"))
                ),
                new CountryDoc(
                        "Нигер",
                        "Niger",
                        new ArrayList<>(Arrays.asList("Агадес", "Айору", "Арлит", "Бирни-Нгауре", "Бирнин-Конни", "Гая",
                                "Дакоро", "Диффа", "Догондучи", "Досо", "Зиндер", "Иллела", "Магариа", "Мадава", "Маради",
                                "Матамейе", "Маяхи", "Мирья", "Нгигми", "Ниамей", "Тахуа", "Тера", "Тесава", "Тибири",
                                "Тиллабери"))
                ),
                new CountryDoc(
                        "Нигерия",
                        "Nigeria",
                        new ArrayList<>(Arrays.asList("Аба", "Абакалики", "Абеокута", "Абуджа", "Адо-Экити", "Акуре",
                                "Асаба", "Баучи", "Бенин-Сити", "Варри", "Гбоко", "Гомбе", "Джалинго", "Джимета", "Джос",
                                "Зариа", "Ибадан", "Иджебу-Оде", "Илеша", "Илобу", "Илорин", "Ифе", "Кадуна", "Калабар",
                                "Кано", "Кацина", "Лагос", "Майдугури", "Минна", "Оверри", "Огбомошо", "Ойо", "Ондо",
                                "Онича", "Ошогбо", "Порт-Харкорт", "Сапеле", "Сокото", "Уйо", "Энугу"))
                ),
                new CountryDoc(
                        "Северная Корея",
                        "North Korea",
                        new ArrayList<>(Arrays.asList("Анджу", "Вонсан", "Канге", "Кимчхэк", "Кусон", "Кэсон", "Кэчхон",
                                "Манпхо", "Мунчхон", "Нампхо", "Насон", "Пхеньян", "Пхёнсон", "Самджиён", "Саривон",
                                "Синпхо", "Синыйджу", "Сонним", "Сунчхон", "Танчхон", "Токчхон", "Хамхын", "Хверён",
                                "Хесан", "Хыйчхон", "Хэджу", "Чонджу", "Чхонджин"))
                ),
                new CountryDoc(
                        "Северная Македония",
                        "North Macedonia",
                        new ArrayList<>(Arrays.asList("Берово", "Битола", "Богданци", "Валандово", "Велес", "Виница",
                                "Гевгелия", "Гостивар", "Дебар", "Делчево", "Демир-Капия", "Демир-Хисар", "Кавадарци",
                                "Кичево", "Кочани", "Кратово", "Крива-Паланка", "Крушево", "Куманово", "Македонска-Каменица",
                                "Македонски-Брод", "Неготино", "Охрид", "Пехчево", "Прилеп", "Пробиштип", "Радовиш",
                                "Ресен", "Свети-Николе", "Скопье", "Струга", "Струмица", "Тетово", "Штип"))
                ),
                new CountryDoc(
                        "Норвегия",
                        "Norway",
                        new ArrayList<>(Arrays.asList("Аверой", "Алвдал", "Альстахауг", "Альта", "Амот", "Андебу", "Андой",
                                "Апдал", "Арендаль", "Аскер", "Аским", "Аскёй", "Балестранд", "Бамбл", "Барду", "Берген",
                                "Биаркой", "Биркенес", "Бронной", "Брюне", "Будё", "Бэрум", "Бюгланн", "Бюкле", "Бёмлу",
                                "Вага", "Вагсой", "Вадсо", "Валер", "Ванг", "Вардё", "Вегорсхей", "Веннесла", "Вердал",
                                "Вествогей", "Вестре Слидре", "Ветсби", "Вефсн", "Вик", "Викна", "Винье", "Волда"))
                ),
                new CountryDoc(
                        "Оман",
                        "Oman",
                        new ArrayList<>(Arrays.asList("Аваби", "Адам", "Амират", "Бадийя", "Барка", "Баушар", "Бахла",
                                "Бени-Бу-Али", "Бидбид", "Биляд-Бени-Бу-Хасан", "Вади-Эль-Маавиль", "Данк",
                                "Дима-Ват-Таиин", "Ибра", "Ибри", "Изки", "Кабиль", "Курейят", "Лива", "Манах", "Маскат",
                                "Маснаа", "Матрах", "Мирбат", "Мудейби", "Назва", "Нахль", "Салала", "Сахм", "Сиб", "Сохар",
                                "Сувейк", "Сумаил", "Сур", "Така", "Хабура", "Хамра", "Хасаб", "Шинас", "Эль-Бурайми"))
                ),
                new CountryDoc(
                        "Пакистан",
                        "Pakistan",
                        new ArrayList<>(Arrays.asList("Абботтабад", "Алпурай", "Аминпур", "Ангур-Ада", "Арифвала",
                                "Астор", "Атток", "Ахмадпур-Ист", "Бадин", "Банну", "Бархан", "Бат-Кхела", "Баттаграм",
                                "Баффа", "Бахавалнагар", "Бахавалпур", "Бела", "Бунджи", "Буревала", "Бхаккар",
                                "Вазирабад", "Вана", "Вах", "Вашук", "Вихари", "Гакуч", "Гвадар", "Гилгит", "Годжра",
                                "Горикот", "Гуджар-Хан", "Гуджранвала", "Гуджрат", "Гулистан", "Гхотки", "Даггар"))
                ),
                new CountryDoc(
                        "Палау",
                        "Palau",
                        new ArrayList<>(Arrays.asList("Аираи", "Бкулангрилл", "Клоулклабед", "Корор", "Меюнс", "Нгерулмуд",
                                "Нгеткиб"))
                ), new CountryDoc(
                        "Панама",
                        "Panama",
                        new ArrayList<>(Arrays.asList("Агуа-Буэна", "Агуадульсе", "Аланхе", "Алиганди", "Алькальде-Диас",
                                "Альмиранте", "Альто-де-да-Эстансия", "Альто-дель-Эспино", "Анкон", "Антон", "Аррайхан",
                                "Асеррио-де-Гариче", "Аталая", "Ачутупо", "Багала", "Берба", "Бока-де-Парита",
                                "Бокас-дель-Торо", "Бокерон", "Бокете", "Бугаба", "Бурика", "Вакамонте", "Валле-дель-Риско",
                                "Вилья-Кармен", "Вилья-Росарио", "Волькан", "Гарачине", "Гариче", "Гуабито", "Гуалака"))
                ),
                new CountryDoc(
                        "Папуа-Новая Гвинея",
                        "Papua New Guinea",
                        new ArrayList<>(Arrays.asList("Айтапе", "Алотау", "Амбунти", "Ангорам", "Арава", "Балимо", "Бука",
                                "Булоло", "Вабаг", "Ванимо", "Вау", "Вевак", "Горока", "Дару", "Йалибу", "Кавиенг",
                                "Каинанту", "Кандриан", "Керема", "Киета", "Кимбе", "Киунга", "Кокода", "Кокопо",
                                "Кундиава", "Лаиагам", "Лаэ", "Лоренгау", "Маданг", "Маунт-Хаген", "Менди", "Морхед",
                                "Наматанаи", "Пангуна", "Попондетта", "Поргера", "Порт-Морсби", "Рабаул", "Самарай", "Тари",
                                "Финшхафен"))
                ),
                new CountryDoc(
                        "Парагвай",
                        "Paraguay",
                        new ArrayList<>(Arrays.asList("Асунсьон", "Вилья-Элиса", "Итаугуа", "Каагуасу", "Капьята",
                                "Консепсьон", "Коронель-Овьедо", "Ламбаре", "Лимпио", "Луке", "Мариано-Роке-Алонсо",
                                "Ньемби", "Педро-Хуан-Кабальеро", "Преcиденте-Франко", "Сан-Антонио", "Сан-Лоренсо",
                                "Сьюдад-дель-Эсте", "Фернандо-де-ла-Мора", "Энкарнасьон", "Эрнандариас"))
                ),
                new CountryDoc(
                        "Перу",
                        "Peru",
                        new ArrayList<>(Arrays.asList("Абанкай", "Айявири", "Андауайлас", "Арекипа", "Асангаро", "Аякучо",
                                "Багуа", "Багуа-Гранде", "Барранка", "Гуадалупе", "Ика", "Икитос", "Илаве", "Ило",
                                "Империал", "Касма", "Катакаос", "Кахамарка", "Кильябамба", "Куско", "Кутерво", "Ла-Арена",
                                "Ла-Мерсед", "Ла-Оройя", "Ламбаеке", "Лима", "Мала", "Могегуа", "Мойобамба", "Мольендо",
                                "Монсефу", "Моче", "Наска", "Нуэва-Кахамарка", "Паихан", "Пайта", "Пакасмайо", "Писко"))
                ),
                new CountryDoc(
                        "Филиппины",
                        "Philippines",
                        new ArrayList<>(Arrays.asList("Абра де Иог", "Алабел", "Алегрия", "Алкой", "Альфонсо", "Анда",
                                "Анжелес", "Антиполо Сити", "Арнао", "Багак", "Багио", "Баклион", "Баланга", "Балаян",
                                "Банау", "Бантаян", "Барас", "Батангас", "Бауан", "Бинангонан", "Боколад", "Болинао",
                                "Боракай", "Бороган", "Бохоль", "Бусуанга", "Бутуан", "Виган", "Генерал-Сантос", "Гуиан",
                                "Даанбантаян", "Давао", "Дагупан", "Далагуете", "Дапитан", "Дарага", "Дауин", "Дауис"))
                ),
                new CountryDoc(
                        "Польша",
                        "Poland",
                        new ArrayList<>(Arrays.asList("Августов", "Александрув-Куявски", "Александрув-Лудзки", "Альверня",
                                "Андрыхув", "Аннополь", "Бабимост", "Баборув", "Баранув-Сандомерский", "Барвице", "Бардо",
                                "Барлинек", "Бартошице", "Барцин", "Барчево", "Бежунь", "Белжице", "Белосток", "Белхатув",
                                "Бельск-Подляски", "Бельско-Бяла", "Белява", "Бендзин", "Берунь", "Берутув", "Беч", "Бжег",
                                "Бжег-Дольны", "Бжезины", "Бжеско", "Бжесць-Куявски", "Бжеще", "Бжозув", "Бжостек"))
                ),
                new CountryDoc(
                        "Португалия",
                        "Portugal",
                        new ArrayList<>(Arrays.asList("Абрантиш", "Авейру", "Авиш", "Агеда", "Агиар-да-Бейра", "Азамбужа",
                                "Албергария-а-Велья", "Албуфейра", "Алваязери", "Алвиту", "Аленкер", "Алжезур",
                                "Алжуштрел", "Алижо", "Алканена", "Алкасер-ду-Сал", "Алкобаса", "Алкошети", "Алмада",
                                "Алмейда", "Алмейрин", "Алмодовар", "Алпиарса", "Алтер-ду-Шан", "Алфандега-да-Фе",
                                "Амадора", "Амаранти", "Амариш", "Анадия", "Ансиан", "Арганил", "Аркуш-ди-Валдевеш"))
                ),
                new CountryDoc(
                        "Пуэрто-Рико",
                        "Puerto Rico",
                        new ArrayList<>(Arrays.asList("Агуада", "Агуадилья", "Адхунтас", "Баямон", "Гуайнабо", "Гуаяма",
                                "Кагуас", "Кайей", "Каролина", "Катаньо", "Ларес", "Лукильо", "Маягуэс", "Пеньюэлас",
                                "Понсе", "Ринкон", "Салинас", "Сейба", "Сидра", "Трухильо-Альто", "Умакао", "Фахардо",
                                "Яуко"))
                ),
                new CountryDoc(
                        "Катар",
                        "Qatar",
                        new ArrayList<>(Arrays.asList("Абу-Залуф", "Ал Вакрах", "Аль Яссасия", "Города Катара", "Доха",
                                "Духан", "Лусаил", "Ум-Салаль", "Умм-Саид", "Хувайр", "Шахания", "Эль-Вакра",
                                "Эль-Джамилия", "Эль-Хаур", "Эр-Райн", "Эр-Райян", "Эр-Рувайс", "Эш-Шамаль", "Эш-Шахания"))
                ),
                new CountryDoc(
                        "Республика Конго",
                        "Republic of the Congo",
                        new ArrayList<>(Arrays.asList("Браззавиль", "Весо", "Гамбома", "Джамбала", "Импфондо", "Кинкала",
                                "Лоанго", "Лубомо", "Мадингу", "Макуа", "Матсанга", "Моссенджо", "Нгамаба-Мфилу", "Нкайи",
                                "Овандо", "Ойо", "Пуэнт-Нуар", "Сембе", "Сибити"))
                ), new CountryDoc(
                        "Румыния",
                        "Romania",
                        new ArrayList<>(Arrays.asList("Абруд", "Авриг", "Агнита", "Аджуд", "Азуга", "Алба-Юлия", "Александрия",
                                "Алешд", "Анина", "Аниноаса", "Арад", "Аюд", "Бабадаг", "Бакэу", "Балш", "Бараолт",
                                "Бая-Маре", "Бая-Сприе", "Бая-де-Арамэ", "Бая-де-Арьеш", "Беклян", "Берешти", "Беюш",
                                "Биказ", "Бистрица", "Блаж", "Бокша", "Болдешти-Скэени", "Болинтин-Вале", "Борсек",
                                "Борша", "Ботошани", "Брад", "Брашов", "Брезой", "Брэила", "Бряза", "Будешти", "Бузиаш"))
                ),
                new CountryDoc(
                        "Россия",
                        "Russia",
                        new ArrayList<>(Arrays.asList("Балаково", "Барнаул", "Волгоград", "Воронеж", "Екатеринбург",
                                "Иркутск", "Казань", "Калининград", "Краснодар", "Красноярск", "Липецк", "Москва",
                                "Мурманск", "Нижний Новгород", "Новосибирск", "Омск", "Орел", "Пенза", "Пермь", "Пугачев",
                                "Ростов-на-Дону", "Самара", "Санкт-Петербург", "Саратов", "Сочи", "Ставрополь", "Таганрог",
                                "Тольятти", "Ульяновск", "Уфа", "Хабаровск", "Челябинск", "Якутск", "Ярославль"))
                ),
                new CountryDoc(
                        "Руанда",
                        "Rwanda",
                        new ArrayList<>(Arrays.asList("Бигогве", "Бугарама", "Бусого", "Гичумби", "Женда", "Кабуга",
                                "Кайонза", "Каронги", "Кигали", "Киниги", "Мугина", "Мукамира", "Мусанзе", "Муханга",
                                "Нгома", "Ньягатаре", "Ньямагабе", "Ньямата", "Ньянза", "Рвамагана", "Рвимияга", "Рубаву",
                                "Рубенгера", "Руензи", "Русизи", "Руханго", "Хуе"))
                ),
                new CountryDoc(
                        "Сент-Китс и Невис",
                        "Saint Kitts and Nevis",
                        new ArrayList<>(Arrays.asList("Крайст-Чёрч-Никола-Таун", "Сент-Джеймс-Уиндуорд", "Сент-Джон-Капистер",
                                "Сент-Джон-Фигтри", "Сент-Джордж-Бастер", "Сент-Джордж-Джинджерланд", "Сент-Мери-Кайон",
                                "Сент-Питер-Бастер", "Сент-Пол-Капистер", "Сент-Пол-Чарлстаун", "Сент-Томас-Лоуленд",
                                "Сент-Томас-Мидл-Айленд", "Сент-Энн-Сэнди-Пойнт", "Тринити-Палметто-Пойнт"))
                ),
                new CountryDoc(
                        "Сент-Люсия",
                        "Saint Lucia",
                        new ArrayList<>(Arrays.asList("Анс-ла-Рей", "Бабонно", "Бизе", "Бокаж", "Вьё-Фор", "Гроз-Иле",
                                "Деннери", "Канари", "Кастри", "Лабори", "Маригот", "Мику", "Мон-Репос", "Монши", "О Табор",
                                "Прален", "Равин-Пошен", "Родни", "Росо", "Саусис", "Суфриер", "Ти Рочер", "Шуазёль"))
                ),
                new CountryDoc(
                        "Сент-Винсент и Гренадины",
                        "Saint Vincent and the Grenadines",
                        new ArrayList<>(Arrays.asList("Гренадины", "Сент-Андру", "Сент-Джордж", "Сент-Дэвид", "Сент-Патрик",
                                "Шарлотта"))
                ),
                new CountryDoc(
                        "Самоа",
                        "Samoa",
                        new ArrayList<>(Arrays.asList("Апиа", "Афега", "Ваилеле", "Ваителе", "Ваиусу", "Лаулии", "Леауваа",
                                "Малие", "Нофоалии", "Сиусега", "Фалеасиу", "Фалеула", "Фаситоута"))
                ),
                new CountryDoc(
                        "Сан-Марино",
                        "San Marino",
                        new ArrayList<>(Arrays.asList("Аккуавива", "Борго-Маджоре", "Догана", "Доманьяно", "Кьезануова",
                                "Монтеджардино", "Сан-Марино", "Серравалле", "Фаэтано", "Фьорентино"))
                ),
                new CountryDoc(
                        "Сан-Томе и Принсипи",
                        "Sao Tome and Principe",
                        new ArrayList<>(Arrays.asList("Гвадалупе", "Невеш", "Пантуфу", "Порту-Алегри",
                                "Сан-Жуан-дуз-Анголареш", "Сан-Томе", "Санта-Катарина", "Санта-Круш", "Сантана", "Санту-Амару",
                                "Санту-Антонью", "Триндади"))
                ),
                new CountryDoc(
                        "Саудовская Аравия",
                        "Saudi Arabia",
                        new ArrayList<>(Arrays.asList("Абха", "Аръар", "Бурайда", "Дахран", "Джидда", "Джизан", "Медина",
                                "Мекка", "Наджран", "Сакака", "Табук", "Унайза", "Хаиль", "Хамис-Мушайт", "Хафар-эль-Батин",
                                "Эд-Даммам", "Эль-Джубайль", "Эль-Катиф", "Эль-Курайят", "Эль-Хавийя", "Эль-Хардж",
                                "Эль-Хубар", "Эль-Хуфуф", "Эр-Рияд", "Эт-Таиф", "Эт-Тукба", "Янбу-эль-Бахр"))
                ), new CountryDoc(
                        "Сенегал",
                        "Senegal",
                        new ArrayList<>(Arrays.asList("Бигнона", "Велингара", "Дакар", "Дара", "Диурбель", "Жоаль-Фадиут",
                                "Зигиншор", "Каолак", "Кафрин", "Колда", "Луга", "Мбаке", "Мбур", "Ниоро", "Ришар-Толь",
                                "Сен-Луи", "Тамбакунда", "Тивауан", "Тиес", "Туба", "Фатик"))
                ),
                new CountryDoc(
                        "Сербия",
                        "Serbia",
                        new ArrayList<>(Arrays.asList("Аранделовац", "Баня Ковиляча", "Бачка-Паланка", "Бачка-Топола",
                                "Белград", "Велика Плана", "Велико-Градиште", "Владичин-Хан", "Враник", "Вранье",
                                "Врнячка Баня", "Вршац", "Димитровград", "Заечар", "Златибор", "Зренянин", "Княжевац",
                                "Ковачица", "Копаоник", "Крагуевац", "Кралево", "Крушевац", "Лесковац", "Мали-Зворник",
                                "Неготин", "Ниш", "Нишка-Баня", "Нови Пазар", "Нови-Бечей", "Нови-Сад", "Палич", "Панчево"))
                ),
                new CountryDoc(
                        "Сейшельские острова",
                        "Seychelles",
                        new ArrayList<>(Arrays.asList("Анс-Буало", "Анс-Вольбер", "Анс-Ройяль", "Беломбр", "Бо-Валлон",
                                "Виктория", "Гран-Анс", "Де-Куинси", "Каскад", "Ла-Реюньон", "Машабе", "Мизер", "Порт-Глод",
                                "Такамака"))
                ),
                new CountryDoc(
                        "Сьерра-Леоне",
                        "Sierra Leone",
                        new ArrayList<>(Arrays.asList("Бо", "Бумпе", "Гандорхун", "Годерич", "Енгема", "Кабала",
                                "Кайлахун", "Камбиа", "Кенема", "Коинду", "Лунсар", "Магбурака", "Макени", "Пендембу",
                                "Порт-Локо", "Рокупр", "Сегбвема", "Сефаду", "Уотерлу", "Фритаун"))
                ),
                new CountryDoc(
                        "Сингапур",
                        "Singapore",
                        new ArrayList<>(List.of("Сингапур"))
                ),
                new CountryDoc(
                        "Словакия",
                        "Slovakia",
                        new ArrayList<>(Arrays.asList("Бановце-над-Бебравоу", "Банска-Бистрица", "Банска-Штьявница",
                                "Бардеёв", "Битча", "Бойнице", "Братислава", "Брезно", "Брезова-под-Брадлом",
                                "Вельке-Капушаны", "Вельки-Кртиш", "Вельки-Медер", "Вельки-Шариш", "Високе-Татри",
                                "Врабле", "Вранов-над-Топлёу", "Врбове", "Врутки", "Габчиково", "Галанта", "Гандлова",
                                "Ганушовце-над-Топлёу", "Гбелы", "Гелница", "Гиралтовце", "Глоговец", "Гнуштя", "Голич"))
                ),
                new CountryDoc(
                        "Словения",
                        "Slovenia",
                        new ArrayList<>(Arrays.asList("Айдовшчина", "Анкаран", "Бегунье-на-Гореньскем", "Блед", "Бовец",
                                "Богинйска Бистрица", "Бохинь", "Брда", "Брезиче", "Брезовицы", "Веленье", "Вержей",
                                "Верхние Горы", "Врхника", "Горисница", "Гросупле", "Гузд Мартулжек", "Диваца", "Добрна",
                                "Доленски Топлице", "Домжале", "Дравоград", "Есенице", "Жалец", "Згорнье Жезерско",
                                "Згорнье Полскава", "Иваньковцы", "Иг", "Изола", "Камник", "Кате об Сави", "Кобарид"))
                ),
                new CountryDoc(
                        "Соломоновы острова",
                        "Solomon Islands",
                        new ArrayList<>(Arrays.asList("Ауки", "Буала", "Гизо", "Киракира", "Лата", "Маланго", "Мунда",
                                "Норо", "Тандаи", "Таро", "Тигоа", "Тулаги", "Хониара"))
                ),
                new CountryDoc(
                        "Сомали",
                        "Somalia",
                        new ArrayList<>(Arrays.asList("Афгойе", "Байдабо", "Бардера", "Беледуэйне", "Бербера", "Борама",
                                "Босасо", "Буръо", "Галькайо", "Гароуэ", "Джамаме", "Джилиб", "Джоухар", "Кардхо", "Кисмайо",
                                "Курулей", "Ласъанод", "Марка", "Могадишо", "Харгейса"))
                ),
                new CountryDoc(
                        "Южная Африка",
                        "South Africa",
                        new ArrayList<>(Arrays.asList("Албертон", "Бенони", "Бетал", "Бишо", "Блумфонтейн", "Боксбург",
                                "Ботшабело", "Бракпан", "Велком", "Вестонария", "Вирджиния", "Вустер", "Делмас", "Джордж",
                                "Дурбан", "Ист-Лондон", "Йоханнесбург", "Карлтонвилл", "Кейптаун", "Кимберли", "Клерксдорп",
                                "Крюгерсдорп", "Куинстаун", "Кутлванонг", "Мидделбург", "Мидранд", "Мпумаланга", "Найджел",
                                "Оркни", "Парл", "Пит-Ретиф", "Питермарицбург", "Полокване", "Порт-Элизабет", "Претория"))
                ), new CountryDoc(
                        "Южная Корея",
                        "South Korea",
                        new ArrayList<>(Arrays.asList("Андон", "Ансан", "Ансон", "Анян", "Асан", "Вонджу", "Иксан", "Инчхон",
                                "Ичхон", "Йонджу", "Йончхон", "Йонъин", "Йосу", "Каннын", "Кванджу", "Кванмён", "Кванъян",
                                "Квачхон", "Керён", "Кимдже", "Кимпхо", "Кимхэ", "Кимчхон", "Кодже", "Конджу", "Коян",
                                "Куми", "Кунпхо", "Кунсан", "Кури", "Кёнджу", "Кёнсан", "Мирян", "Мокпхо", "Мунгён",
                                "Наджу", "Намвон", "Намъянджу", "Нонсан", "Осан", "Порён", "Пусан", "Пучхон", "Пхаджу"))
                ),
                new CountryDoc(
                        "Испания",
                        "Spain",
                        new ArrayList<>(Arrays.asList("Аликанте", "Алькала-де-Энарес", "Бадалона", "Барселона", "Бильбао",
                                "Валенсия", "Вальядолид", "Виго", "Витория", "Гранада", "Картахена", "Кордова", "Ла-Корунья",
                                "Лас-Пальмас-де-Гран-Канария", "Мадрид", "Малага", "Мостолес", "Мурсия", "Овьедо", "Оспиталет",
                                "Пальма", "Сабадель", "Санта-Крус-де-Тенерифе", "Сарагоса", "Севилья", "Террасса",
                                "Херес-де-ла-Фронтера", "Хихон", "Эльче"))
                ),
                new CountryDoc(
                        "Шри-Ланка",
                        "Sri Lanka",
                        new ArrayList<>(Arrays.asList("Амбалангода", "Ампара", "Анурадхапура", "Бадулла", "Балангода",
                                "Бандаравела", "Баттикалоа", "Берувала", "Вавуния", "Валветтитурай", "Ваттала", "Ваттегама",
                                "Велигама", "Галле", "Гампаха", "Гампола", "Дамбулла", "Дехивала-Маунт-Лавиния", "Джа-Эла",
                                "Джафна", "Кадуганнава", "Калмунай", "Калутара", "Канди", "Каттанкуди", "Катунаяке",
                                "Кегалле", "Келания", "Коломбо", "Колоннава", "Кулияпития", "Курунегала", "Маннар"))
                ),
                new CountryDoc(
                        "Судан",
                        "Sudan",
                        new ArrayList<>(Arrays.asList("Аль-Джазира-Аба", "Асалая", "Атбара", "Вад-Медани", "Гедареф",
                                "Кадугли", "Кассала", "Кости", "Ньяла", "Омдурман", "Порт-Судан", "Рабак",
                                "Северный Хартум", "Сеннар", "Синджа", "Тендельти", "Умм-Руваба", "Хальфа-эль-Джадида",
                                "Хартум", "Хашм-эль-Кирба", "Шенди", "Эд-Дамазин", "Эд-Дамер", "Эд-Даэйн", "Эд-Дуэйм",
                                "Эль-Генейна", "Эль-Менакил", "Эль-Обейд", "Эль-Фашер", "Эн-Нухуд"))
                ),
                new CountryDoc(
                        "Суринам",
                        "Suriname",
                        new ArrayList<>(Arrays.asList("Албина", "Браунсвег", "Брокопондо", "Вагенинген", "Гронинген",
                                "Лелидорп", "Мариенбург", "Мерзорг", "Мунго", "Ньив-Амстердам", "Ньив-Никкери", "Онвервахт",
                                "Тотнесс"))
                ),
                new CountryDoc(
                        "Эсватини",
                        "Swaziland",
                        new ArrayList<>(Arrays.asList("Биг-Бенд", "Булембу", "Буня", "Вувулане", "Квалусени", "Лобамба",
                                "Малкернс", "Манзини", "Мбабане", "Мпака", "Мхламбаняци", "Мхлуме", "Нгомане", "Нхлангано",
                                "Пигс-Пик", "Симунье", "Ситеки", "Табанкулу", "Хлатикулу", "Хлути"))
                ),
                new CountryDoc(
                        "Швеция",
                        "Sweden",
                        new ArrayList<>(Arrays.asList("Алингсос", "Арбога", "Борлэнге", "Буден", "Бурос", "Буу", "Вадстена",
                                "Валлэнтуна", "Варберг", "Векшё", "Вестерос", "Висбы", "Вэнерсборг", "Вэрнаму",
                                "Вэстэрвик", "Гётеборг", "Евле", "Истад", "Йёнчёпинг", "Кальмар", "Карлскруна",
                                "Карлскуга", "Карлстад", "Карлсхамн", "Катринехольм", "Кируна", "Кристианстад",
                                "Кристинехамн", "Кунгсбакка", "Кунгэльв", "Ландскруна", "Лахольм", "Лерум", "Лидингё"))
                ),
                new CountryDoc(
                        "Швейцария",
                        "Switzerland",
                        new ArrayList<>(Arrays.asList("Адлисвиль", "Айнзидельн", "Альтдорф", "Альтштеттен", "Альшвиль",
                                "Амрисвиль", "Аппенцелль", "Арау", "Арбон", "Арлесхайм", "Ароза", "Арт",
                                "Аффольтерн-на-Альбисе", "Баден", "Базель", "Бар", "Бассерсдорф", "Беллинцона", "Бельп",
                                "Берн", "Биль", "Биннинген", "Бирсфельден", "Бриг", "Бругг", "Букс", "Бургдорф", "Буссиньи",
                                "Бюлах", "Бюль", "Вайнфельден", "Валлизеллен", "Веве", "Веденсвиль", "Вернье", "Версуа"))
                ),
                new CountryDoc(
                        "Сирия",
                        "Syria",
                        new ArrayList<>(Arrays.asList("Аазаз", "Абу-Камаль", "Айн-эль-Араб", "Алеппо", "Африн", "Банияс",
                                "Дайр-эз-Заур", "Дамаск", "Дарайя", "Даръа", "Дейр-Хафир", "Дерик", "Джабла", "Джераблус",
                                "Джиср-эш-Шугур", "Дума", "Идлиб", "Изра", "Кардаха", "Катана", "Кунейтра", "Латакия",
                                "Мааррет-эн-Нууман", "Манбидж", "Масьяф", "Меядин", "Мухаррам-эль-Фаукани", "Мухрада",
                                "Рас-эль-Айн", "Саламия", "Сафира", "Сафита", "Скальбия", "Тадмор", "Тартус", "Телль-Ду"))
                ),
                new CountryDoc(
                        "Тайвань",
                        "Taiwan",
                        new ArrayList<>(Arrays.asList("Гаосюн", "Доулю", "Илань", "Магун", "Мяоли", "Наньтоу", "Пиндун",
                                "Пуцзы", "Синьбэй", "Синьчжу", "Тайбао", "Тайбэй", "Тайдун", "Тайнань", "Тайчжун",
                                "Таоюань", "Тоуфэнь", "Хуалянь", "Цзилун", "Цзяи", "Чжанхуа", "Чжубэй", "Юаньлинь"))
                ), new CountryDoc(
                        "Таджикистан",
                        "Tajikistan",
                        new ArrayList<>(Arrays.asList("Бохтар", "Бустон", "Вахдат", "Гиссар", "Гулистон", "Душанбе",
                                "Истаравшан", "Истиклол", "Исфара", "Канибадам", "Куляб", "Левакант", "Нурек",
                                "Пенджикент", "Рогун", "Турсунзаде", "Хорог", "Худжанд"))
                ),
                new CountryDoc(
                        "Танзания",
                        "Tanzania",
                        new ArrayList<>(Arrays.asList("Аруша", "Букоба", "Дар-эс-Салам", "Додома", "Занзибар", "Иринга",
                                "Казиламихунда", "Касуло", "Кигома", "Мбея", "Мванза", "Морогоро", "Моши", "Мусома",
                                "Сонгеа", "Сумбаванга", "Табора", "Танга", "Увинза", "Шиньянга"))
                ),
                new CountryDoc(
                        "Таиланд",
                        "Thailand",
                        new ArrayList<>(Arrays.asList("Айотья", "Амнатчарен", "Ангтхонг", "Араньяпратет", "Аюттхая",
                                "Банбынг", "Бангбуатхонг", "Бангкок", "Бангкруай", "Бангмуннак", "Банми", "Банпонг",
                                "Банпхру", "Банчанг", "Бетонг", "Буаяй", "Бурирам", "Варинчамрап", "Каласин", "Кампхэнгпхет",
                                "Кантанг", "Кантхаралак", "Канчанабури", "Косамуй", "Краби", "Кратхумбэн", "Кхелангнакхон",
                                "Кхлонглуанг", "Кхлунг", "Кхонкэн", "Кхукхот", "Лампанг", "Лампхун", "Лангсуан", "Латлуанг"))
                ),
                new CountryDoc(
                        "Того",
                        "Togo",
                        new ArrayList<>(Arrays.asList("Амламе", "Анехо", "Атакпаме", "Баду", "Басар", "Бафило", "Воган",
                                "Дапаон", "Канде", "Кара", "Кпалиме", "Ломе", "Манго", "Ниамтугу", "Нотсе", "Пагуда",
                                "Сокоде", "Сотубуа", "Таблигбо", "Цевие", "Чамба"))
                ),
                new CountryDoc(
                        "Тонга",
                        "Tonga",
                        new ArrayList<>(Arrays.asList("Ваини", "Муа", "Неиафу", "Нукуалофа", "Охонуа", "Пангаи", "Тофоа-Колоа",
                                "Хавелолото", "Хихифо"))
                ),
                new CountryDoc(
                        "Тринидад и Тобаго",
                        "Trinidad and Tobago",
                        new ArrayList<>(Arrays.asList("Арима", "Валенсия", "Гаспарилло", "Диего-Мартин", "Клакстон-Бэй",
                                "Кува", "Морвант", "Пенал", "Пойнт-Фортин", "Порт-оф-Спейн", "Принсес-Таун", "Сан-Фернандо",
                                "Сан-Хуан", "Сангре-Гранде", "Сипария", "Скарборо", "Тунапуна", "Физабад", "Фрипорт",
                                "Чагуанас"))
                ),
                new CountryDoc(
                        "Тунис",
                        "Tunisia",
                        new ArrayList<>(Arrays.asList("Арьяна", "Бардо", "Беджа", "Бен-Арус", "Бен-Кардан", "Бизерта",
                                "Габес", "Гафса", "Дуар-Хишер", "Зарзис", "Кайруан", "Кассерин", "Ла-Марса", "Ле-Крам",
                                "Меденин", "Мидун", "Монастир", "Мсакен", "Набуль", "Рауэд", "Сукра", "Сус", "Сфакс",
                                "Татавин", "Тунис", "Хаммамет", "Хумт-Сук", "Эль-Мурудж", "Эт-Тадамун"))
                ),
                new CountryDoc(
                        "Турция",
                        "Turkey",
                        new ArrayList<>(Arrays.asList("Аванос", "Адакёй", "Адана", "Адапазары", "Аджарлар", "Адрасан",
                                "Адыяман", "Айваджик", "Айвалык", "Айдин", "Акбук", "Акиюрт", "Аксакоса", "Акхисар",
                                "Акчай", "Акьяка", "Акьярлар", "Аланья", "Алачати", "Алашехир", "Алтинкум", "Алтинолук",
                                "Амасра", "Анамур", "Анкара", "Антакья", "Анталья", "Арапгир", "Ардесен", "Армутлу",
                                "Артвин", "Ассос", "Афьонкарахисар", "Аяс", "Бадемли", "Балабани", "Балыкесир", "Бейджик",
                                "Бейшехир", "Белек", "Бельдиби", "Бергама", "Битез", "Богазичи", "Богазкале", "Бодрум"))
                ),
                new CountryDoc(
                        "Туркменистан",
                        "Turkmenistan",
                        new ArrayList<>(Arrays.asList("Ёлётен", "Акдепе", "Андалып", "Аннау", "Ашхабад", "Бабадайхан",
                                "Байрамали", "Балканабад", "Бахарден", "Берекет", "Болдумсаз", "Газаджак", "Гарабекевюл",
                                "Губадаг", "Гызыларбат", "Гёкдепе", "Гёроглы", "Дарганата", "Дашогуз", "Достлук", "Дянев",
                                "Кака", "Карабогаз", "Керки", "Койтендаг", "Кёнеургенч", "Магданлы", "Мары", "Махтумкули",
                                "Мургап", "Сакар", "Сакарчага", "Саят", "Сейди", "Серхетабад", "Теджен", "Туркменабад"))
                ),
                new CountryDoc(
                        "Уганда",
                        "Uganda",
                        new ArrayList<>(Arrays.asList("Аруа", "Гулу", "Джинджа", "Иганга", "Кабале", "Кампала", "Касесе",
                                "Китгум", "Кобоко", "Лира", "Масака", "Мбале", "Мбарара", "Митьяна", "Муконо", "Нджеру",
                                "Небби", "Тороро", "Хоима", "Энтеббе"))
                ), new CountryDoc(
                        "Украина",
                        "Ukraine",
                        new ArrayList<>(Arrays.asList("Александрия", "Ананьев", "Андрушёвка", "Арциз", "Балаклея", "Балта",
                                "Барановка", "Баштанка", "Белая Церковь", "Белз", "Берегово", "Винница", "Житомир", "Киев",
                                "Львов", "Одесса", "Полтава", "Ровно", "Сумы", "Харьков", "Чернигов"))
                ),
                new CountryDoc(
                        "ОАЭ",
                        "United Arab Emirates",
                        new ArrayList<>(Arrays.asList("Абу-Даби", "Абу-эль-Абьяд", "Аджман", "Азен", "Асимах",
                                "Вади-Шах", "Джабаль-Али", "Дибба Эль-Фуджайра", "Дибба Эль-Хисн", "Дигдага", "Дубай",
                                "Зайед Порт", "Зайид", "Кальба", "Мадинат-Зайед", "Манама", "Маравах", "Масафи", "Масфут",
                                "Мирбах", "Рас-эль-Хайма", "Сваихан", "Сила", "Сир-Бани-Яс", "Умм-эль-Кайвайн",
                                "Фаладж-эль-Муалла", "Хабшан", "Хайяти", "Халилах", "Халифа Порт", "Хатт", "Хатта"))
                ),
                new CountryDoc(
                        "США",
                        "United States of America",
                        new ArrayList<>(Arrays.asList("Абердин", "Авалон", "Авани", "Авентура", "Авила Бич", "Авистон",
                                "Авока", "Аврора", "Агора Хиллз", "Адамс", "Адамстаун", "Аделанто", "Адель", "Адриан",
                                "Азуза", "Аикен", "Айвинз", "Айда Гроув", "Айдахо-Спрингс", "Айдахо-Фоллз", "Айдиллуайльд",
                                "Айдлейд Парк", "Айен Маунтин", "Айен Ривер", "Айенвуд", "Айзеллин", "Айл оф Памз",
                                "Айленд Парк", "Айова", "Айова Сити", "Айова Фоллз", "Айола", "Айони", "Айрондейл"))
                ),
                new CountryDoc(
                        "Уругвай",
                        "Uruguay",
                        new ArrayList<>(Arrays.asList("Артигас", "Баррос-Бланкос", "Белья-Унион", "Долорес", "Дурасно",
                                "Канелонес", "Кармело", "Колония-дель-Сакраменто", "Ла-Пас", "Лас-Пьедрас", "Мальдонадо",
                                "Мело", "Мерседес", "Минас", "Монтевидео", "Нуэва-Эльвесия", "Пайсанду", "Пандо",
                                "Пасо-Карраско", "Пасо-де-лос-Торос", "Прогресо", "Ривера", "Рио-Бранко", "Росарио",
                                "Роча", "Сальто", "Сан-Карлос", "Сан-Хосе-де-Майо", "Санта-Лусия", "Сьюдад-де-ла-Коста"))
                ),
                new CountryDoc(
                        "Узбекистан",
                        "Uzbekistan",
                        new ArrayList<>(Arrays.asList("Аккурган", "Акташ", "Алат", "Алмалык", "Ангрен", "Андижан", "Асака",
                                "Ахангаран", "Байсун", "Бахт", "Бекабад", "Беруни", "Бешарык", "Бешкент", "Бука", "Булунгур",
                                "Бустан", "Бухара", "Вабкент", "Гагарин", "Газалкент", "Газган", "Газли", "Галаасия",
                                "Галляарал", "Гиждуван", "Гузар", "Гулистан", "Даштабад", "Денау", "Джалакудук", "Джамбай",
                                "Джаркурган", "Джизак", "Джума", "Дустабад", "Дустлик", "Зарафшан", "Иштыхан", "Каган"))
                ),
                new CountryDoc(
                        "Вануату",
                        "Vanuatu",
                        new ArrayList<>(Arrays.asList("Абватунбулива", "Исангел", "Крейг-Коув", "Лакаторо", "Левиамп",
                                "Ленакел", "Литслитс", "Лонгана", "Люганвиль", "Меле", "Норсуп", "Пакликуло",
                                "Пенап-Ламап-Рамбуан", "Порт Олри", "Порт-Вила", "Сола", "Хог-Харбур"))
                ),
                new CountryDoc(
                        "Венесуэла",
                        "Venezuela",
                        new ArrayList<>(Arrays.asList("Акаригуа", "Анако", "Арагуа-де-Барселона", "Ачагуас", "Байладорес",
                                "Баринас", "Барселона", "Бейума", "Бируака", "Бока-де-Учире", "Брусуаль", "Валера",
                                "Валье-де-Гуанапе", "Гибралтар", "Гуакара", "Гуанаре", "Гуанта", "Гуаренас", "Гуасдуалито",
                                "Гуатире", "Кабимас", "Кабударе", "Каматагуа", "Кантаура", "Карупано", "Кларинес",
                                "Колония Товар", "Коро", "Кумана", "Ла-Асунсьон", "Ла-Виктория", "Ла-Гуайра", "Лечерия"))
                ),
                new CountryDoc(
                        "Вьетнам",
                        "Vietnam",
                        new ArrayList<>(Arrays.asList("Ан Жианг", "Ба Риа", "Бак Ха", "Бан Бо", "Бао Лок", "Бен Тре",
                                "Бингх Дингх", "Буон Ма Туот", "Бьенхоа", "Вин Иен", "Винь", "Вунгтау", "Далат", "Дананг",
                                "Дат До", "Ди Ан", "Донгхой", "Дьен", "Дьенбьенфу", "Зыонгдонг", "Камау", "Камрань",
                                "Кант Хо", "Кат Ба", "Ке Га", "Ко То", "Кон Дао", "Ксуен Мок", "Куа Ло", "Куан Лан",
                                "Куанг-Нгай", "Куинён", "Ла-Джи", "Ланг Сон", "Лаокай", "Лонг Диен", "Лонг Хай", "Лонг тан"))
                ),
                new CountryDoc(
                        "Йемен",
                        "Yemen",
                        new ArrayList<>(Arrays.asList("Аден", "Амран", "Баджиль", "Дамар", "Ибб", "Сада", "Сана", "Таиз",
                                "Ходейда", "Эль-Мукалла"))
                ),
                new CountryDoc(
                        "Замбия",
                        "Zambia",
                        new ArrayList<>(Arrays.asList("Кабве", "Калулуши", "Кансанши", "Капири-Мпоши", "Касама", "Кафуэ",
                                "Китве-Нкана", "Ливингстон", "Луаншья", "Лусака", "Мазабука", "Манса", "Монгу", "Монзе",
                                "Муфулира", "Ндола", "Чилилабомбве", "Чингола", "Чипата", "Чома"))
                ), new CountryDoc(
                        "Зимбабве",
                        "Zimbabwe",
                        new ArrayList<>(Arrays.asList("Байтбридж", "Биндура", "Булавайо", "Виктория-Фолс", "Гверу",
                                "Звишаване", "Кадома", "Квекве", "Марондера", "Масвинго", "Мутаре", "Нортон", "Редклифф",
                                "Рува", "Хараре", "Хванге", "Чегуту", "Чинхойи", "Читунгвиза", "Эпворт"))
                )
        ));
        countryDocs.sort(Comparator.comparing(CountryDoc::getCountryRU));
        return countryDocs;
    }
}
